/* automatically generated by rust-bindgen */

pub const L_tmpnam: u32 = 20;
pub const L_ctermid: u32 = 9;
pub const GPLOT_VERSION_NUMBER: u32 = 1;
pub const JB_TEMPLATE_EXT: &'static [u8; 15usize] = b".templates.png\0";
pub const JB_DATA_EXT: &'static [u8; 6usize] = b".data\0";
pub const SEL_VERSION_NUMBER: u32 = 1;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::std::os::raw::c_ushort,
    pub __ctype_tolower: *const ::std::os::raw::c_int,
    pub __ctype_toupper: *const ::std::os::raw::c_int,
    pub __names: [*const ::std::os::raw::c_char; 13usize],
}
#[test]
fn bindgen_test_layout___locale_struct() {
    assert_eq!(
        ::std::mem::size_of::<__locale_struct>(),
        232usize,
        concat!("Size of: ", stringify!(__locale_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<__locale_struct>(),
        8usize,
        concat!("Alignment of ", stringify!(__locale_struct))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__locales as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__locales)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__ctype_b as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_b)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__ctype_tolower as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_tolower)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__ctype_toupper as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_toupper)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__names as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__names)
        )
    );
}
extern "C" {
    pub fn strtok(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strtok_r(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
        __save_ptr: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
pub type __int32_t = ::std::os::raw::c_int;
pub type __quad_t = ::std::os::raw::c_long;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __time_t = ::std::os::raw::c_long;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: ::std::os::raw::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: ::std::os::raw::c_uint,
    pub __wchb: [::std::os::raw::c_char; 4usize],
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout___mbstate_t__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__mbstate_t__bindgen_ty_1>())).__wch as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wch)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__mbstate_t__bindgen_ty_1>())).__wchb as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wchb)
        )
    );
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t>(),
        8usize,
        concat!("Size of: ", stringify!(__mbstate_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__mbstate_t>())).__count as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__mbstate_t>())).__value as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__value)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos_t() {
    assert_eq!(
        ::std::mem::size_of::<_G_fpos_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_G_fpos_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_G_fpos_t>())).__pos as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_G_fpos_t>())).__state as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__state)
        )
    );
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    pub _next: *mut _IO_marker,
    pub _sbuf: *mut _IO_FILE,
    pub _pos: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__IO_marker() {
    assert_eq!(
        ::std::mem::size_of::<_IO_marker>(),
        24usize,
        concat!("Size of: ", stringify!(_IO_marker))
    );
    assert_eq!(
        ::std::mem::align_of::<_IO_marker>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_marker))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_marker>()))._next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_marker),
            "::",
            stringify!(_next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_marker>()))._sbuf as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_marker),
            "::",
            stringify!(_sbuf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_marker>()))._pos as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_marker),
            "::",
            stringify!(_pos)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub __pad1: *mut ::std::os::raw::c_void,
    pub __pad2: *mut ::std::os::raw::c_void,
    pub __pad3: *mut ::std::os::raw::c_void,
    pub __pad4: *mut ::std::os::raw::c_void,
    pub __pad5: usize,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[test]
fn bindgen_test_layout__IO_FILE() {
    assert_eq!(
        ::std::mem::size_of::<_IO_FILE>(),
        216usize,
        concat!("Size of: ", stringify!(_IO_FILE))
    );
    assert_eq!(
        ::std::mem::align_of::<_IO_FILE>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_FILE))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_ptr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_end as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_base as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_base as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_ptr as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_end as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_buf_base as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_buf_end as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_save_base as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_backup_base as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_backup_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_save_end as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._markers as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_markers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._chain as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_chain)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._fileno as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_fileno)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._flags2 as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._old_offset as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_old_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._cur_column as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_cur_column)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._vtable_offset as *const _ as usize },
        130usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_vtable_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._shortbuf as *const _ as usize },
        131usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_shortbuf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._lock as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_lock)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._offset as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>())).__pad1 as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>())).__pad2 as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>())).__pad3 as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad3)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>())).__pad4 as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad4)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>())).__pad5 as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad5)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._mode as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._unused2 as *const _ as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_unused2)
        )
    );
}
pub type fpos_t = _G_fpos_t;
extern "C" {
    pub fn setbuf(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn setvbuf(
        __stream: *mut FILE,
        __buf: *mut ::std::os::raw::c_char,
        __modes: ::std::os::raw::c_int,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setbuffer(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char, __size: usize);
}
extern "C" {
    pub fn setlinebuf(__stream: *mut FILE);
}
extern "C" {
    pub fn fgetc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getw(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgets(
        __s: *mut ::std::os::raw::c_char,
        __n: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getline(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn fgetpos(__stream: *mut FILE, __pos: *mut fpos_t) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TessResultRenderer {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TessTextRenderer {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TessHOcrRenderer {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TessPDFRenderer {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TessUnlvRenderer {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TessBoxTextRenderer {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TessBaseAPI {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TessPageIterator {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TessResultIterator {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TessMutableIterator {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TessChoiceIterator {
    _unused: [u8; 0],
}
pub const TessOcrEngineMode_OEM_TESSERACT_ONLY: TessOcrEngineMode = 0;
pub const TessOcrEngineMode_OEM_LSTM_ONLY: TessOcrEngineMode = 1;
pub const TessOcrEngineMode_OEM_TESSERACT_LSTM_COMBINED: TessOcrEngineMode = 2;
pub const TessOcrEngineMode_OEM_DEFAULT: TessOcrEngineMode = 3;
pub type TessOcrEngineMode = u32;
pub const TessPageSegMode_PSM_OSD_ONLY: TessPageSegMode = 0;
pub const TessPageSegMode_PSM_AUTO_OSD: TessPageSegMode = 1;
pub const TessPageSegMode_PSM_AUTO_ONLY: TessPageSegMode = 2;
pub const TessPageSegMode_PSM_AUTO: TessPageSegMode = 3;
pub const TessPageSegMode_PSM_SINGLE_COLUMN: TessPageSegMode = 4;
pub const TessPageSegMode_PSM_SINGLE_BLOCK_VERT_TEXT: TessPageSegMode = 5;
pub const TessPageSegMode_PSM_SINGLE_BLOCK: TessPageSegMode = 6;
pub const TessPageSegMode_PSM_SINGLE_LINE: TessPageSegMode = 7;
pub const TessPageSegMode_PSM_SINGLE_WORD: TessPageSegMode = 8;
pub const TessPageSegMode_PSM_CIRCLE_WORD: TessPageSegMode = 9;
pub const TessPageSegMode_PSM_SINGLE_CHAR: TessPageSegMode = 10;
pub const TessPageSegMode_PSM_SPARSE_TEXT: TessPageSegMode = 11;
pub const TessPageSegMode_PSM_SPARSE_TEXT_OSD: TessPageSegMode = 12;
pub const TessPageSegMode_PSM_COUNT: TessPageSegMode = 13;
pub type TessPageSegMode = u32;
pub const TessPageIteratorLevel_RIL_BLOCK: TessPageIteratorLevel = 0;
pub const TessPageIteratorLevel_RIL_PARA: TessPageIteratorLevel = 1;
pub const TessPageIteratorLevel_RIL_TEXTLINE: TessPageIteratorLevel = 2;
pub const TessPageIteratorLevel_RIL_WORD: TessPageIteratorLevel = 3;
pub const TessPageIteratorLevel_RIL_SYMBOL: TessPageIteratorLevel = 4;
pub type TessPageIteratorLevel = u32;
pub const TessPolyBlockType_PT_UNKNOWN: TessPolyBlockType = 0;
pub const TessPolyBlockType_PT_FLOWING_TEXT: TessPolyBlockType = 1;
pub const TessPolyBlockType_PT_HEADING_TEXT: TessPolyBlockType = 2;
pub const TessPolyBlockType_PT_PULLOUT_TEXT: TessPolyBlockType = 3;
pub const TessPolyBlockType_PT_EQUATION: TessPolyBlockType = 4;
pub const TessPolyBlockType_PT_INLINE_EQUATION: TessPolyBlockType = 5;
pub const TessPolyBlockType_PT_TABLE: TessPolyBlockType = 6;
pub const TessPolyBlockType_PT_VERTICAL_TEXT: TessPolyBlockType = 7;
pub const TessPolyBlockType_PT_CAPTION_TEXT: TessPolyBlockType = 8;
pub const TessPolyBlockType_PT_FLOWING_IMAGE: TessPolyBlockType = 9;
pub const TessPolyBlockType_PT_HEADING_IMAGE: TessPolyBlockType = 10;
pub const TessPolyBlockType_PT_PULLOUT_IMAGE: TessPolyBlockType = 11;
pub const TessPolyBlockType_PT_HORZ_LINE: TessPolyBlockType = 12;
pub const TessPolyBlockType_PT_VERT_LINE: TessPolyBlockType = 13;
pub const TessPolyBlockType_PT_NOISE: TessPolyBlockType = 14;
pub const TessPolyBlockType_PT_COUNT: TessPolyBlockType = 15;
pub type TessPolyBlockType = u32;
pub const TessOrientation_ORIENTATION_PAGE_UP: TessOrientation = 0;
pub const TessOrientation_ORIENTATION_PAGE_RIGHT: TessOrientation = 1;
pub const TessOrientation_ORIENTATION_PAGE_DOWN: TessOrientation = 2;
pub const TessOrientation_ORIENTATION_PAGE_LEFT: TessOrientation = 3;
pub type TessOrientation = u32;
pub const TessParagraphJustification_JUSTIFICATION_UNKNOWN: TessParagraphJustification = 0;
pub const TessParagraphJustification_JUSTIFICATION_LEFT: TessParagraphJustification = 1;
pub const TessParagraphJustification_JUSTIFICATION_CENTER: TessParagraphJustification = 2;
pub const TessParagraphJustification_JUSTIFICATION_RIGHT: TessParagraphJustification = 3;
pub type TessParagraphJustification = u32;
pub const TessWritingDirection_WRITING_DIRECTION_LEFT_TO_RIGHT: TessWritingDirection = 0;
pub const TessWritingDirection_WRITING_DIRECTION_RIGHT_TO_LEFT: TessWritingDirection = 1;
pub const TessWritingDirection_WRITING_DIRECTION_TOP_TO_BOTTOM: TessWritingDirection = 2;
pub type TessWritingDirection = u32;
pub const TessTextlineOrder_TEXTLINE_ORDER_LEFT_TO_RIGHT: TessTextlineOrder = 0;
pub const TessTextlineOrder_TEXTLINE_ORDER_RIGHT_TO_LEFT: TessTextlineOrder = 1;
pub const TessTextlineOrder_TEXTLINE_ORDER_TOP_TO_BOTTOM: TessTextlineOrder = 2;
pub type TessTextlineOrder = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ETEXT_DESC {
    _unused: [u8; 0],
}
extern "C" {
    pub fn TessVersion() -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn TessDeleteText(text: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn TessDeleteTextArray(arr: *mut *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn TessDeleteIntArray(arr: *mut ::std::os::raw::c_int);
}
extern "C" {
    pub fn TessTextRendererCreate(
        outputbase: *const ::std::os::raw::c_char,
    ) -> *mut TessResultRenderer;
}
extern "C" {
    pub fn TessHOcrRendererCreate(
        outputbase: *const ::std::os::raw::c_char,
    ) -> *mut TessResultRenderer;
}
extern "C" {
    pub fn TessHOcrRendererCreate2(
        outputbase: *const ::std::os::raw::c_char,
        font_info: ::std::os::raw::c_int,
    ) -> *mut TessResultRenderer;
}
extern "C" {
    pub fn TessPDFRendererCreate(
        outputbase: *const ::std::os::raw::c_char,
        datadir: *const ::std::os::raw::c_char,
        textonly: ::std::os::raw::c_int,
    ) -> *mut TessResultRenderer;
}
extern "C" {
    pub fn TessUnlvRendererCreate(
        outputbase: *const ::std::os::raw::c_char,
    ) -> *mut TessResultRenderer;
}
extern "C" {
    pub fn TessBoxTextRendererCreate(
        outputbase: *const ::std::os::raw::c_char,
    ) -> *mut TessResultRenderer;
}
extern "C" {
    pub fn TessDeleteResultRenderer(renderer: *mut TessResultRenderer);
}
extern "C" {
    pub fn TessResultRendererInsert(
        renderer: *mut TessResultRenderer,
        next: *mut TessResultRenderer,
    );
}
extern "C" {
    pub fn TessResultRendererNext(renderer: *mut TessResultRenderer) -> *mut TessResultRenderer;
}
extern "C" {
    pub fn TessResultRendererBeginDocument(
        renderer: *mut TessResultRenderer,
        title: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TessResultRendererAddImage(
        renderer: *mut TessResultRenderer,
        api: *mut TessBaseAPI,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TessResultRendererEndDocument(
        renderer: *mut TessResultRenderer,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TessResultRendererExtention(
        renderer: *mut TessResultRenderer,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn TessResultRendererTitle(
        renderer: *mut TessResultRenderer,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn TessResultRendererImageNum(renderer: *mut TessResultRenderer) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TessBaseAPICreate() -> *mut TessBaseAPI;
}
extern "C" {
    pub fn TessBaseAPIDelete(handle: *mut TessBaseAPI);
}
extern "C" {
    pub fn TessBaseAPIGetOpenCLDevice(
        handle: *mut TessBaseAPI,
        device: *mut *mut ::std::os::raw::c_void,
    ) -> usize;
}
extern "C" {
    pub fn TessBaseAPISetInputName(handle: *mut TessBaseAPI, name: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn TessBaseAPIGetInputName(handle: *mut TessBaseAPI) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn TessBaseAPISetInputImage(handle: *mut TessBaseAPI, pix: *mut Pix);
}
extern "C" {
    pub fn TessBaseAPIGetInputImage(handle: *mut TessBaseAPI) -> *mut Pix;
}
extern "C" {
    pub fn TessBaseAPIGetSourceYResolution(handle: *mut TessBaseAPI) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TessBaseAPIGetDatapath(handle: *mut TessBaseAPI) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn TessBaseAPISetOutputName(handle: *mut TessBaseAPI, name: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn TessBaseAPISetVariable(
        handle: *mut TessBaseAPI,
        name: *const ::std::os::raw::c_char,
        value: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TessBaseAPISetDebugVariable(
        handle: *mut TessBaseAPI,
        name: *const ::std::os::raw::c_char,
        value: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TessBaseAPIGetIntVariable(
        handle: *const TessBaseAPI,
        name: *const ::std::os::raw::c_char,
        value: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TessBaseAPIGetBoolVariable(
        handle: *const TessBaseAPI,
        name: *const ::std::os::raw::c_char,
        value: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TessBaseAPIGetDoubleVariable(
        handle: *const TessBaseAPI,
        name: *const ::std::os::raw::c_char,
        value: *mut f64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TessBaseAPIGetStringVariable(
        handle: *const TessBaseAPI,
        name: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn TessBaseAPIPrintVariables(handle: *const TessBaseAPI, fp: *mut FILE);
}
extern "C" {
    pub fn TessBaseAPIPrintVariablesToFile(
        handle: *const TessBaseAPI,
        filename: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TessBaseAPIInit1(
        handle: *mut TessBaseAPI,
        datapath: *const ::std::os::raw::c_char,
        language: *const ::std::os::raw::c_char,
        oem: TessOcrEngineMode,
        configs: *mut *mut ::std::os::raw::c_char,
        configs_size: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TessBaseAPIInit2(
        handle: *mut TessBaseAPI,
        datapath: *const ::std::os::raw::c_char,
        language: *const ::std::os::raw::c_char,
        oem: TessOcrEngineMode,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TessBaseAPIInit3(
        handle: *mut TessBaseAPI,
        datapath: *const ::std::os::raw::c_char,
        language: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TessBaseAPIInit4(
        handle: *mut TessBaseAPI,
        datapath: *const ::std::os::raw::c_char,
        language: *const ::std::os::raw::c_char,
        mode: TessOcrEngineMode,
        configs: *mut *mut ::std::os::raw::c_char,
        configs_size: ::std::os::raw::c_int,
        vars_vec: *mut *mut ::std::os::raw::c_char,
        vars_values: *mut *mut ::std::os::raw::c_char,
        vars_vec_size: usize,
        set_only_non_debug_params: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TessBaseAPIGetInitLanguagesAsString(
        handle: *const TessBaseAPI,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn TessBaseAPIGetLoadedLanguagesAsVector(
        handle: *const TessBaseAPI,
    ) -> *mut *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn TessBaseAPIGetAvailableLanguagesAsVector(
        handle: *const TessBaseAPI,
    ) -> *mut *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn TessBaseAPIInitLangMod(
        handle: *mut TessBaseAPI,
        datapath: *const ::std::os::raw::c_char,
        language: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TessBaseAPIInitForAnalysePage(handle: *mut TessBaseAPI);
}
extern "C" {
    pub fn TessBaseAPIReadConfigFile(
        handle: *mut TessBaseAPI,
        filename: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn TessBaseAPIReadDebugConfigFile(
        handle: *mut TessBaseAPI,
        filename: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn TessBaseAPISetPageSegMode(handle: *mut TessBaseAPI, mode: TessPageSegMode);
}
extern "C" {
    pub fn TessBaseAPIGetPageSegMode(handle: *const TessBaseAPI) -> TessPageSegMode;
}
extern "C" {
    pub fn TessBaseAPIRect(
        handle: *mut TessBaseAPI,
        imagedata: *const ::std::os::raw::c_uchar,
        bytes_per_pixel: ::std::os::raw::c_int,
        bytes_per_line: ::std::os::raw::c_int,
        left: ::std::os::raw::c_int,
        top: ::std::os::raw::c_int,
        width: ::std::os::raw::c_int,
        height: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn TessBaseAPIClearAdaptiveClassifier(handle: *mut TessBaseAPI);
}
extern "C" {
    pub fn TessBaseAPISetImage(
        handle: *mut TessBaseAPI,
        imagedata: *const ::std::os::raw::c_uchar,
        width: ::std::os::raw::c_int,
        height: ::std::os::raw::c_int,
        bytes_per_pixel: ::std::os::raw::c_int,
        bytes_per_line: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn TessBaseAPISetImage2(handle: *mut TessBaseAPI, pix: *mut Pix);
}
extern "C" {
    pub fn TessBaseAPISetSourceResolution(handle: *mut TessBaseAPI, ppi: ::std::os::raw::c_int);
}
extern "C" {
    pub fn TessBaseAPISetRectangle(
        handle: *mut TessBaseAPI,
        left: ::std::os::raw::c_int,
        top: ::std::os::raw::c_int,
        width: ::std::os::raw::c_int,
        height: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn TessBaseAPIGetThresholdedImage(handle: *mut TessBaseAPI) -> *mut Pix;
}
extern "C" {
    pub fn TessBaseAPIGetRegions(handle: *mut TessBaseAPI, pixa: *mut *mut Pixa) -> *mut Boxa;
}
extern "C" {
    pub fn TessBaseAPIGetTextlines(
        handle: *mut TessBaseAPI,
        pixa: *mut *mut Pixa,
        blockids: *mut *mut ::std::os::raw::c_int,
    ) -> *mut Boxa;
}
extern "C" {
    pub fn TessBaseAPIGetTextlines1(
        handle: *mut TessBaseAPI,
        raw_image: ::std::os::raw::c_int,
        raw_padding: ::std::os::raw::c_int,
        pixa: *mut *mut Pixa,
        blockids: *mut *mut ::std::os::raw::c_int,
        paraids: *mut *mut ::std::os::raw::c_int,
    ) -> *mut Boxa;
}
extern "C" {
    pub fn TessBaseAPIGetStrips(
        handle: *mut TessBaseAPI,
        pixa: *mut *mut Pixa,
        blockids: *mut *mut ::std::os::raw::c_int,
    ) -> *mut Boxa;
}
extern "C" {
    pub fn TessBaseAPIGetWords(handle: *mut TessBaseAPI, pixa: *mut *mut Pixa) -> *mut Boxa;
}
extern "C" {
    pub fn TessBaseAPIGetConnectedComponents(
        handle: *mut TessBaseAPI,
        cc: *mut *mut Pixa,
    ) -> *mut Boxa;
}
extern "C" {
    pub fn TessBaseAPIGetComponentImages(
        handle: *mut TessBaseAPI,
        level: TessPageIteratorLevel,
        text_only: ::std::os::raw::c_int,
        pixa: *mut *mut Pixa,
        blockids: *mut *mut ::std::os::raw::c_int,
    ) -> *mut Boxa;
}
extern "C" {
    pub fn TessBaseAPIGetComponentImages1(
        handle: *mut TessBaseAPI,
        level: TessPageIteratorLevel,
        text_only: ::std::os::raw::c_int,
        raw_image: ::std::os::raw::c_int,
        raw_padding: ::std::os::raw::c_int,
        pixa: *mut *mut Pixa,
        blockids: *mut *mut ::std::os::raw::c_int,
        paraids: *mut *mut ::std::os::raw::c_int,
    ) -> *mut Boxa;
}
extern "C" {
    pub fn TessBaseAPIGetThresholdedImageScaleFactor(
        handle: *const TessBaseAPI,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TessBaseAPIAnalyseLayout(handle: *mut TessBaseAPI) -> *mut TessPageIterator;
}
extern "C" {
    pub fn TessBaseAPIRecognize(
        handle: *mut TessBaseAPI,
        monitor: *mut ETEXT_DESC,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TessBaseAPIRecognizeForChopTest(
        handle: *mut TessBaseAPI,
        monitor: *mut ETEXT_DESC,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TessBaseAPIProcessPages(
        handle: *mut TessBaseAPI,
        filename: *const ::std::os::raw::c_char,
        retry_config: *const ::std::os::raw::c_char,
        timeout_millisec: ::std::os::raw::c_int,
        renderer: *mut TessResultRenderer,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TessBaseAPIProcessPage(
        handle: *mut TessBaseAPI,
        pix: *mut Pix,
        page_index: ::std::os::raw::c_int,
        filename: *const ::std::os::raw::c_char,
        retry_config: *const ::std::os::raw::c_char,
        timeout_millisec: ::std::os::raw::c_int,
        renderer: *mut TessResultRenderer,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TessBaseAPIGetIterator(handle: *mut TessBaseAPI) -> *mut TessResultIterator;
}
extern "C" {
    pub fn TessBaseAPIGetMutableIterator(handle: *mut TessBaseAPI) -> *mut TessMutableIterator;
}
extern "C" {
    pub fn TessBaseAPIGetUTF8Text(handle: *mut TessBaseAPI) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn TessBaseAPIGetHOCRText(
        handle: *mut TessBaseAPI,
        page_number: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn TessBaseAPIGetBoxText(
        handle: *mut TessBaseAPI,
        page_number: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn TessBaseAPIGetUNLVText(handle: *mut TessBaseAPI) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn TessBaseAPIMeanTextConf(handle: *mut TessBaseAPI) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TessBaseAPIAllWordConfidences(handle: *mut TessBaseAPI) -> *mut ::std::os::raw::c_int;
}
extern "C" {
    pub fn TessBaseAPIAdaptToWordStr(
        handle: *mut TessBaseAPI,
        mode: TessPageSegMode,
        wordstr: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TessBaseAPIClear(handle: *mut TessBaseAPI);
}
extern "C" {
    pub fn TessBaseAPIEnd(handle: *mut TessBaseAPI);
}
extern "C" {
    pub fn TessBaseAPIIsValidWord(
        handle: *mut TessBaseAPI,
        word: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TessBaseAPIGetTextDirection(
        handle: *mut TessBaseAPI,
        out_offset: *mut ::std::os::raw::c_int,
        out_slope: *mut f32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TessBaseAPIGetUnichar(
        handle: *mut TessBaseAPI,
        unichar_id: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn TessBaseAPISetMinOrientationMargin(handle: *mut TessBaseAPI, margin: f64);
}
extern "C" {
    pub fn TessPageIteratorDelete(handle: *mut TessPageIterator);
}
extern "C" {
    pub fn TessPageIteratorCopy(handle: *const TessPageIterator) -> *mut TessPageIterator;
}
extern "C" {
    pub fn TessPageIteratorBegin(handle: *mut TessPageIterator);
}
extern "C" {
    pub fn TessPageIteratorNext(
        handle: *mut TessPageIterator,
        level: TessPageIteratorLevel,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TessPageIteratorIsAtBeginningOf(
        handle: *const TessPageIterator,
        level: TessPageIteratorLevel,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TessPageIteratorIsAtFinalElement(
        handle: *const TessPageIterator,
        level: TessPageIteratorLevel,
        element: TessPageIteratorLevel,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TessPageIteratorBoundingBox(
        handle: *const TessPageIterator,
        level: TessPageIteratorLevel,
        left: *mut ::std::os::raw::c_int,
        top: *mut ::std::os::raw::c_int,
        right: *mut ::std::os::raw::c_int,
        bottom: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TessPageIteratorBlockType(handle: *const TessPageIterator) -> TessPolyBlockType;
}
extern "C" {
    pub fn TessPageIteratorGetBinaryImage(
        handle: *const TessPageIterator,
        level: TessPageIteratorLevel,
    ) -> *mut Pix;
}
extern "C" {
    pub fn TessPageIteratorGetImage(
        handle: *const TessPageIterator,
        level: TessPageIteratorLevel,
        padding: ::std::os::raw::c_int,
        original_image: *mut Pix,
        left: *mut ::std::os::raw::c_int,
        top: *mut ::std::os::raw::c_int,
    ) -> *mut Pix;
}
extern "C" {
    pub fn TessPageIteratorBaseline(
        handle: *const TessPageIterator,
        level: TessPageIteratorLevel,
        x1: *mut ::std::os::raw::c_int,
        y1: *mut ::std::os::raw::c_int,
        x2: *mut ::std::os::raw::c_int,
        y2: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TessPageIteratorOrientation(
        handle: *mut TessPageIterator,
        orientation: *mut TessOrientation,
        writing_direction: *mut TessWritingDirection,
        textline_order: *mut TessTextlineOrder,
        deskew_angle: *mut f32,
    );
}
extern "C" {
    pub fn TessPageIteratorParagraphInfo(
        handle: *mut TessPageIterator,
        justification: *mut TessParagraphJustification,
        is_list_item: *mut ::std::os::raw::c_int,
        is_crown: *mut ::std::os::raw::c_int,
        first_line_indent: *mut ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn TessResultIteratorDelete(handle: *mut TessResultIterator);
}
extern "C" {
    pub fn TessResultIteratorCopy(handle: *const TessResultIterator) -> *mut TessResultIterator;
}
extern "C" {
    pub fn TessResultIteratorGetPageIterator(
        handle: *mut TessResultIterator,
    ) -> *mut TessPageIterator;
}
extern "C" {
    pub fn TessResultIteratorGetPageIteratorConst(
        handle: *const TessResultIterator,
    ) -> *const TessPageIterator;
}
extern "C" {
    pub fn TessResultIteratorGetChoiceIterator(
        handle: *const TessResultIterator,
    ) -> *mut TessChoiceIterator;
}
extern "C" {
    pub fn TessResultIteratorNext(
        handle: *mut TessResultIterator,
        level: TessPageIteratorLevel,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TessResultIteratorGetUTF8Text(
        handle: *const TessResultIterator,
        level: TessPageIteratorLevel,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn TessResultIteratorConfidence(
        handle: *const TessResultIterator,
        level: TessPageIteratorLevel,
    ) -> f32;
}
extern "C" {
    pub fn TessResultIteratorWordRecognitionLanguage(
        handle: *const TessResultIterator,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn TessResultIteratorWordFontAttributes(
        handle: *const TessResultIterator,
        is_bold: *mut ::std::os::raw::c_int,
        is_italic: *mut ::std::os::raw::c_int,
        is_underlined: *mut ::std::os::raw::c_int,
        is_monospace: *mut ::std::os::raw::c_int,
        is_serif: *mut ::std::os::raw::c_int,
        is_smallcaps: *mut ::std::os::raw::c_int,
        pointsize: *mut ::std::os::raw::c_int,
        font_id: *mut ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn TessResultIteratorWordIsFromDictionary(
        handle: *const TessResultIterator,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TessResultIteratorWordIsNumeric(
        handle: *const TessResultIterator,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TessResultIteratorSymbolIsSuperscript(
        handle: *const TessResultIterator,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TessResultIteratorSymbolIsSubscript(
        handle: *const TessResultIterator,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TessResultIteratorSymbolIsDropcap(
        handle: *const TessResultIterator,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TessChoiceIteratorDelete(handle: *mut TessChoiceIterator);
}
extern "C" {
    pub fn TessChoiceIteratorNext(handle: *mut TessChoiceIterator) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TessChoiceIteratorGetUTF8Text(
        handle: *const TessChoiceIterator,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn TessChoiceIteratorConfidence(handle: *const TessChoiceIterator) -> f32;
}
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_div_t() {
    assert_eq!(
        ::std::mem::size_of::<div_t>(),
        8usize,
        concat!("Size of: ", stringify!(div_t))
    );
    assert_eq!(
        ::std::mem::align_of::<div_t>(),
        4usize,
        concat!("Alignment of ", stringify!(div_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<div_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<div_t>())).rem as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout_lldiv_t() {
    assert_eq!(
        ::std::mem::size_of::<lldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(lldiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<lldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(lldiv_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lldiv_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lldiv_t>())).rem as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
extern "C" {
    pub fn strtod(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f64;
}
extern "C" {
    pub fn strtof(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f32;
}
extern "C" {
    pub fn strtold(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> u128;
}
extern "C" {
    pub fn strtol(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn strtoul(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strtoq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtouq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn strtoll(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtoull(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
pub type quad_t = __quad_t;
pub type register_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___sigset_t() {
    assert_eq!(
        ::std::mem::size_of::<__sigset_t>(),
        128usize,
        concat!("Size of: ", stringify!(__sigset_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__sigset_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__sigset_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sigset_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sigset_t),
            "::",
            stringify!(__val)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    assert_eq!(
        ::std::mem::size_of::<timeval>(),
        16usize,
        concat!("Size of: ", stringify!(timeval))
    );
    assert_eq!(
        ::std::mem::align_of::<timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(timeval))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timeval>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timeval>())).tv_usec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_usec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    assert_eq!(
        ::std::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::std::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timespec>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timespec>())).tv_nsec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
    assert_eq!(
        ::std::mem::size_of::<fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(fd_set))
    );
    assert_eq!(
        ::std::mem::align_of::<fd_set>(),
        8usize,
        concat!("Alignment of ", stringify!(fd_set))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fd_set>())).__fds_bits as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fd_set),
            "::",
            stringify!(__fds_bits)
        )
    );
}
extern "C" {
    pub fn select(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __cur_writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __rwelision: ::std::os::raw::c_schar,
    pub __pad1: [::std::os::raw::c_uchar; 7usize],
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_rwlock_arch_t() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_rwlock_arch_t>(),
        56usize,
        concat!("Size of: ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_rwlock_arch_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__readers as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__readers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__writers as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__wrphase_futex as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__wrphase_futex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__writers_futex as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers_futex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad3 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad3)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad4 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad4)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__cur_writer as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__cur_writer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__shared as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__shared)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__rwelision as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__rwelision)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad1 as *const _ as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad2 as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__flags as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__flags)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[test]
fn bindgen_test_layout___pthread_internal_list() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_list>(),
        16usize,
        concat!("Size of: ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_list>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_internal_list>())).__prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_internal_list>())).__next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__next)
        )
    );
}
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[test]
fn bindgen_test_layout___pthread_mutex_s() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_mutex_s>(),
        40usize,
        concat!("Size of: ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_mutex_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__lock as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__lock)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__count as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__owner as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__owner)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__nusers as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__nusers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__kind as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__spins as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__spins)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__elision as *const _ as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__elision)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__list as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__list)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __bindgen_anon_1: __pthread_cond_s__bindgen_ty_1,
    pub __bindgen_anon_2: __pthread_cond_s__bindgen_ty_2,
    pub __g_refs: [::std::os::raw::c_uint; 2usize],
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __pthread_cond_s__bindgen_ty_1 {
    pub __wseq: ::std::os::raw::c_ulonglong,
    pub __wseq32: __pthread_cond_s__bindgen_ty_1__bindgen_ty_1,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>())).__low
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>())).__high
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_cond_s__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1>())).__wseq as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1),
            "::",
            stringify!(__wseq)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1>())).__wseq32 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1),
            "::",
            stringify!(__wseq32)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __pthread_cond_s__bindgen_ty_2 {
    pub __g1_start: ::std::os::raw::c_ulonglong,
    pub __g1_start32: __pthread_cond_s__bindgen_ty_2__bindgen_ty_1,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>())).__low
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>())).__high
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_cond_s__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s__bindgen_ty_2))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2>())).__g1_start as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2),
            "::",
            stringify!(__g1_start)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2>())).__g1_start32 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2),
            "::",
            stringify!(__g1_start32)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s>(),
        48usize,
        concat!("Size of: ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_refs as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_refs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_size as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g1_orig_size as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g1_orig_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__wrefs as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__wrefs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_signals as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_signals)
        )
    );
}
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutexattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutexattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_condattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_condattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_condattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_condattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_condattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 7usize],
}
#[test]
fn bindgen_test_layout_pthread_attr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_attr_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_attr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_attr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_attr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 5usize],
}
#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_mutex_t>(),
        40usize,
        concat!("Size of: ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
    _bindgen_union_align: [u64; 6usize],
}
#[test]
fn bindgen_test_layout_pthread_cond_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 7usize],
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlock_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlock_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_pthread_rwlockattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlockattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlockattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 4usize],
}
#[test]
fn bindgen_test_layout_pthread_barrier_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_barrier_t>(),
        32usize,
        concat!("Size of: ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrier_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrier_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrier_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_barrierattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrierattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrierattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__align)
        )
    );
}
extern "C" {
    pub fn setstate(__statebuf: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct random_data {
    pub fptr: *mut i32,
    pub rptr: *mut i32,
    pub state: *mut i32,
    pub rand_type: ::std::os::raw::c_int,
    pub rand_deg: ::std::os::raw::c_int,
    pub rand_sep: ::std::os::raw::c_int,
    pub end_ptr: *mut i32,
}
#[test]
fn bindgen_test_layout_random_data() {
    assert_eq!(
        ::std::mem::size_of::<random_data>(),
        48usize,
        concat!("Size of: ", stringify!(random_data))
    );
    assert_eq!(
        ::std::mem::align_of::<random_data>(),
        8usize,
        concat!("Alignment of ", stringify!(random_data))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).fptr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(fptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).rptr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).state as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).rand_type as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).rand_deg as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_deg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).rand_sep as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_sep)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).end_ptr as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(end_ptr)
        )
    );
}
extern "C" {
    pub fn setstate_r(
        __statebuf: *mut ::std::os::raw::c_char,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct drand48_data {
    pub __x: [::std::os::raw::c_ushort; 3usize],
    pub __old_x: [::std::os::raw::c_ushort; 3usize],
    pub __c: ::std::os::raw::c_ushort,
    pub __init: ::std::os::raw::c_ushort,
    pub __a: ::std::os::raw::c_ulonglong,
}
#[test]
fn bindgen_test_layout_drand48_data() {
    assert_eq!(
        ::std::mem::size_of::<drand48_data>(),
        24usize,
        concat!("Size of: ", stringify!(drand48_data))
    );
    assert_eq!(
        ::std::mem::align_of::<drand48_data>(),
        8usize,
        concat!("Alignment of ", stringify!(drand48_data))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<drand48_data>())).__x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<drand48_data>())).__old_x as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__old_x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<drand48_data>())).__c as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__c)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<drand48_data>())).__init as *const _ as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__init)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<drand48_data>())).__a as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__a)
        )
    );
}
extern "C" {
    pub fn getenv(__name: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn setenv(
        __name: *const ::std::os::raw::c_char,
        __value: *const ::std::os::raw::c_char,
        __replace: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ecvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ecvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fcvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getsubopt(
        __optionp: *mut *mut ::std::os::raw::c_char,
        __tokens: *const *mut ::std::os::raw::c_char,
        __valuep: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getloadavg(__loadavg: *mut f64, __nelem: ::std::os::raw::c_int)
        -> ::std::os::raw::c_int;
}
pub type l_intptr_t = isize;
pub type l_uintptr_t = usize;
pub type l_int8 = ::std::os::raw::c_schar;
pub type l_uint8 = ::std::os::raw::c_uchar;
pub type l_int16 = ::std::os::raw::c_short;
pub type l_uint16 = ::std::os::raw::c_ushort;
pub type l_int32 = ::std::os::raw::c_int;
pub type l_uint32 = ::std::os::raw::c_uint;
pub type l_float32 = f32;
pub type l_float64 = f64;
pub type l_int64 = ::std::os::raw::c_longlong;
pub type l_uint64 = ::std::os::raw::c_ulonglong;
pub const L_NOT_FOUND: _bindgen_ty_1 = 0;
pub const L_FOUND: _bindgen_ty_1 = 1;
pub type _bindgen_ty_1 = u32;
pub type L_TIMER = *mut ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_WallTimer {
    pub start_sec: l_int32,
    pub start_usec: l_int32,
    pub stop_sec: l_int32,
    pub stop_usec: l_int32,
}
#[test]
fn bindgen_test_layout_L_WallTimer() {
    assert_eq!(
        ::std::mem::size_of::<L_WallTimer>(),
        16usize,
        concat!("Size of: ", stringify!(L_WallTimer))
    );
    assert_eq!(
        ::std::mem::align_of::<L_WallTimer>(),
        4usize,
        concat!("Alignment of ", stringify!(L_WallTimer))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_WallTimer>())).start_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(L_WallTimer),
            "::",
            stringify!(start_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_WallTimer>())).start_usec as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(L_WallTimer),
            "::",
            stringify!(start_usec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_WallTimer>())).stop_sec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(L_WallTimer),
            "::",
            stringify!(stop_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_WallTimer>())).stop_usec as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(L_WallTimer),
            "::",
            stringify!(stop_usec)
        )
    );
}
pub type L_WALLTIMER = L_WallTimer;
pub const L_SEVERITY_EXTERNAL: _bindgen_ty_3 = 0;
pub const L_SEVERITY_ALL: _bindgen_ty_3 = 1;
pub const L_SEVERITY_DEBUG: _bindgen_ty_3 = 2;
pub const L_SEVERITY_INFO: _bindgen_ty_3 = 3;
pub const L_SEVERITY_WARNING: _bindgen_ty_3 = 4;
pub const L_SEVERITY_ERROR: _bindgen_ty_3 = 5;
pub const L_SEVERITY_NONE: _bindgen_ty_3 = 6;
pub type _bindgen_ty_3 = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Numa {
    pub nalloc: l_int32,
    pub n: l_int32,
    pub refcount: l_int32,
    pub startx: l_float32,
    pub delx: l_float32,
    pub array: *mut l_float32,
}
#[test]
fn bindgen_test_layout_Numa() {
    assert_eq!(
        ::std::mem::size_of::<Numa>(),
        32usize,
        concat!("Size of: ", stringify!(Numa))
    );
    assert_eq!(
        ::std::mem::align_of::<Numa>(),
        8usize,
        concat!("Alignment of ", stringify!(Numa))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Numa>())).nalloc as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Numa),
            "::",
            stringify!(nalloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Numa>())).n as *const _ as usize },
        4usize,
        concat!("Offset of field: ", stringify!(Numa), "::", stringify!(n))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Numa>())).refcount as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Numa),
            "::",
            stringify!(refcount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Numa>())).startx as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Numa),
            "::",
            stringify!(startx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Numa>())).delx as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Numa),
            "::",
            stringify!(delx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Numa>())).array as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Numa),
            "::",
            stringify!(array)
        )
    );
}
pub type NUMA = Numa;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Numaa {
    pub nalloc: l_int32,
    pub n: l_int32,
    pub numa: *mut *mut Numa,
}
#[test]
fn bindgen_test_layout_Numaa() {
    assert_eq!(
        ::std::mem::size_of::<Numaa>(),
        16usize,
        concat!("Size of: ", stringify!(Numaa))
    );
    assert_eq!(
        ::std::mem::align_of::<Numaa>(),
        8usize,
        concat!("Alignment of ", stringify!(Numaa))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Numaa>())).nalloc as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Numaa),
            "::",
            stringify!(nalloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Numaa>())).n as *const _ as usize },
        4usize,
        concat!("Offset of field: ", stringify!(Numaa), "::", stringify!(n))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Numaa>())).numa as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Numaa),
            "::",
            stringify!(numa)
        )
    );
}
pub type NUMAA = Numaa;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_Dna {
    pub nalloc: l_int32,
    pub n: l_int32,
    pub refcount: l_int32,
    pub startx: l_float64,
    pub delx: l_float64,
    pub array: *mut l_float64,
}
#[test]
fn bindgen_test_layout_L_Dna() {
    assert_eq!(
        ::std::mem::size_of::<L_Dna>(),
        40usize,
        concat!("Size of: ", stringify!(L_Dna))
    );
    assert_eq!(
        ::std::mem::align_of::<L_Dna>(),
        8usize,
        concat!("Alignment of ", stringify!(L_Dna))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dna>())).nalloc as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dna),
            "::",
            stringify!(nalloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dna>())).n as *const _ as usize },
        4usize,
        concat!("Offset of field: ", stringify!(L_Dna), "::", stringify!(n))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dna>())).refcount as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dna),
            "::",
            stringify!(refcount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dna>())).startx as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dna),
            "::",
            stringify!(startx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dna>())).delx as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dna),
            "::",
            stringify!(delx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dna>())).array as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dna),
            "::",
            stringify!(array)
        )
    );
}
pub type L_DNA = L_Dna;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_Dnaa {
    pub nalloc: l_int32,
    pub n: l_int32,
    pub dna: *mut *mut L_Dna,
}
#[test]
fn bindgen_test_layout_L_Dnaa() {
    assert_eq!(
        ::std::mem::size_of::<L_Dnaa>(),
        16usize,
        concat!("Size of: ", stringify!(L_Dnaa))
    );
    assert_eq!(
        ::std::mem::align_of::<L_Dnaa>(),
        8usize,
        concat!("Alignment of ", stringify!(L_Dnaa))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dnaa>())).nalloc as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dnaa),
            "::",
            stringify!(nalloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dnaa>())).n as *const _ as usize },
        4usize,
        concat!("Offset of field: ", stringify!(L_Dnaa), "::", stringify!(n))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dnaa>())).dna as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dnaa),
            "::",
            stringify!(dna)
        )
    );
}
pub type L_DNAA = L_Dnaa;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_DnaHash {
    pub nbuckets: l_int32,
    pub initsize: l_int32,
    pub dna: *mut *mut L_Dna,
}
#[test]
fn bindgen_test_layout_L_DnaHash() {
    assert_eq!(
        ::std::mem::size_of::<L_DnaHash>(),
        16usize,
        concat!("Size of: ", stringify!(L_DnaHash))
    );
    assert_eq!(
        ::std::mem::align_of::<L_DnaHash>(),
        8usize,
        concat!("Alignment of ", stringify!(L_DnaHash))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_DnaHash>())).nbuckets as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(L_DnaHash),
            "::",
            stringify!(nbuckets)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_DnaHash>())).initsize as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(L_DnaHash),
            "::",
            stringify!(initsize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_DnaHash>())).dna as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(L_DnaHash),
            "::",
            stringify!(dna)
        )
    );
}
pub type L_DNAHASH = L_DnaHash;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Sarray {
    pub nalloc: l_int32,
    pub n: l_int32,
    pub refcount: l_int32,
    pub array: *mut *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_Sarray() {
    assert_eq!(
        ::std::mem::size_of::<Sarray>(),
        24usize,
        concat!("Size of: ", stringify!(Sarray))
    );
    assert_eq!(
        ::std::mem::align_of::<Sarray>(),
        8usize,
        concat!("Alignment of ", stringify!(Sarray))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Sarray>())).nalloc as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Sarray),
            "::",
            stringify!(nalloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Sarray>())).n as *const _ as usize },
        4usize,
        concat!("Offset of field: ", stringify!(Sarray), "::", stringify!(n))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Sarray>())).refcount as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Sarray),
            "::",
            stringify!(refcount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Sarray>())).array as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Sarray),
            "::",
            stringify!(array)
        )
    );
}
pub type SARRAY = Sarray;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_Bytea {
    pub nalloc: usize,
    pub size: usize,
    pub refcount: l_int32,
    pub data: *mut l_uint8,
}
#[test]
fn bindgen_test_layout_L_Bytea() {
    assert_eq!(
        ::std::mem::size_of::<L_Bytea>(),
        32usize,
        concat!("Size of: ", stringify!(L_Bytea))
    );
    assert_eq!(
        ::std::mem::align_of::<L_Bytea>(),
        8usize,
        concat!("Alignment of ", stringify!(L_Bytea))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Bytea>())).nalloc as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Bytea),
            "::",
            stringify!(nalloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Bytea>())).size as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Bytea),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Bytea>())).refcount as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Bytea),
            "::",
            stringify!(refcount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Bytea>())).data as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Bytea),
            "::",
            stringify!(data)
        )
    );
}
pub type L_BYTEA = L_Bytea;
pub const L_LINEAR_INTERP: _bindgen_ty_4 = 1;
pub const L_QUADRATIC_INTERP: _bindgen_ty_4 = 2;
pub type _bindgen_ty_4 = u32;
pub const L_CONTINUED_BORDER: _bindgen_ty_5 = 1;
pub const L_SLOPE_BORDER: _bindgen_ty_5 = 2;
pub const L_MIRRORED_BORDER: _bindgen_ty_5 = 3;
pub type _bindgen_ty_5 = u32;
pub const L_INTEGER_VALUE: _bindgen_ty_6 = 1;
pub const L_FLOAT_VALUE: _bindgen_ty_6 = 2;
pub type _bindgen_ty_6 = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_ByteBuffer {
    pub nalloc: l_int32,
    pub n: l_int32,
    pub nwritten: l_int32,
    pub array: *mut l_uint8,
}
#[test]
fn bindgen_test_layout_L_ByteBuffer() {
    assert_eq!(
        ::std::mem::size_of::<L_ByteBuffer>(),
        24usize,
        concat!("Size of: ", stringify!(L_ByteBuffer))
    );
    assert_eq!(
        ::std::mem::align_of::<L_ByteBuffer>(),
        8usize,
        concat!("Alignment of ", stringify!(L_ByteBuffer))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_ByteBuffer>())).nalloc as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(L_ByteBuffer),
            "::",
            stringify!(nalloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_ByteBuffer>())).n as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(L_ByteBuffer),
            "::",
            stringify!(n)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_ByteBuffer>())).nwritten as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(L_ByteBuffer),
            "::",
            stringify!(nwritten)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_ByteBuffer>())).array as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(L_ByteBuffer),
            "::",
            stringify!(array)
        )
    );
}
pub type L_BBUFFER = L_ByteBuffer;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_Heap {
    pub nalloc: l_int32,
    pub n: l_int32,
    pub array: *mut *mut ::std::os::raw::c_void,
    pub direction: l_int32,
}
#[test]
fn bindgen_test_layout_L_Heap() {
    assert_eq!(
        ::std::mem::size_of::<L_Heap>(),
        24usize,
        concat!("Size of: ", stringify!(L_Heap))
    );
    assert_eq!(
        ::std::mem::align_of::<L_Heap>(),
        8usize,
        concat!("Alignment of ", stringify!(L_Heap))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Heap>())).nalloc as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Heap),
            "::",
            stringify!(nalloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Heap>())).n as *const _ as usize },
        4usize,
        concat!("Offset of field: ", stringify!(L_Heap), "::", stringify!(n))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Heap>())).array as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Heap),
            "::",
            stringify!(array)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Heap>())).direction as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Heap),
            "::",
            stringify!(direction)
        )
    );
}
pub type L_HEAP = L_Heap;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DoubleLinkedList {
    pub prev: *mut DoubleLinkedList,
    pub next: *mut DoubleLinkedList,
    pub data: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_DoubleLinkedList() {
    assert_eq!(
        ::std::mem::size_of::<DoubleLinkedList>(),
        24usize,
        concat!("Size of: ", stringify!(DoubleLinkedList))
    );
    assert_eq!(
        ::std::mem::align_of::<DoubleLinkedList>(),
        8usize,
        concat!("Alignment of ", stringify!(DoubleLinkedList))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DoubleLinkedList>())).prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DoubleLinkedList),
            "::",
            stringify!(prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DoubleLinkedList>())).next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DoubleLinkedList),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DoubleLinkedList>())).data as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(DoubleLinkedList),
            "::",
            stringify!(data)
        )
    );
}
pub type DLLIST = DoubleLinkedList;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_Ptra {
    pub nalloc: l_int32,
    pub imax: l_int32,
    pub nactual: l_int32,
    pub array: *mut *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_L_Ptra() {
    assert_eq!(
        ::std::mem::size_of::<L_Ptra>(),
        24usize,
        concat!("Size of: ", stringify!(L_Ptra))
    );
    assert_eq!(
        ::std::mem::align_of::<L_Ptra>(),
        8usize,
        concat!("Alignment of ", stringify!(L_Ptra))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Ptra>())).nalloc as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Ptra),
            "::",
            stringify!(nalloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Ptra>())).imax as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Ptra),
            "::",
            stringify!(imax)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Ptra>())).nactual as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Ptra),
            "::",
            stringify!(nactual)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Ptra>())).array as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Ptra),
            "::",
            stringify!(array)
        )
    );
}
pub type L_PTRA = L_Ptra;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_Ptraa {
    pub nalloc: l_int32,
    pub ptra: *mut *mut L_Ptra,
}
#[test]
fn bindgen_test_layout_L_Ptraa() {
    assert_eq!(
        ::std::mem::size_of::<L_Ptraa>(),
        16usize,
        concat!("Size of: ", stringify!(L_Ptraa))
    );
    assert_eq!(
        ::std::mem::align_of::<L_Ptraa>(),
        8usize,
        concat!("Alignment of ", stringify!(L_Ptraa))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Ptraa>())).nalloc as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Ptraa),
            "::",
            stringify!(nalloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Ptraa>())).ptra as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Ptraa),
            "::",
            stringify!(ptra)
        )
    );
}
pub type L_PTRAA = L_Ptraa;
pub const L_NO_COMPACTION: _bindgen_ty_7 = 1;
pub const L_COMPACTION: _bindgen_ty_7 = 2;
pub type _bindgen_ty_7 = u32;
pub const L_AUTO_DOWNSHIFT: _bindgen_ty_8 = 0;
pub const L_MIN_DOWNSHIFT: _bindgen_ty_8 = 1;
pub const L_FULL_DOWNSHIFT: _bindgen_ty_8 = 2;
pub type _bindgen_ty_8 = u32;
pub const L_HANDLE_ONLY: _bindgen_ty_9 = 0;
pub const L_REMOVE: _bindgen_ty_9 = 1;
pub type _bindgen_ty_9 = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_Queue {
    pub nalloc: l_int32,
    pub nhead: l_int32,
    pub nelem: l_int32,
    pub array: *mut *mut ::std::os::raw::c_void,
    pub stack: *mut L_Stack,
}
#[test]
fn bindgen_test_layout_L_Queue() {
    assert_eq!(
        ::std::mem::size_of::<L_Queue>(),
        32usize,
        concat!("Size of: ", stringify!(L_Queue))
    );
    assert_eq!(
        ::std::mem::align_of::<L_Queue>(),
        8usize,
        concat!("Alignment of ", stringify!(L_Queue))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Queue>())).nalloc as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Queue),
            "::",
            stringify!(nalloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Queue>())).nhead as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Queue),
            "::",
            stringify!(nhead)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Queue>())).nelem as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Queue),
            "::",
            stringify!(nelem)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Queue>())).array as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Queue),
            "::",
            stringify!(array)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Queue>())).stack as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Queue),
            "::",
            stringify!(stack)
        )
    );
}
pub type L_QUEUE = L_Queue;
pub const L_INT_TYPE: _bindgen_ty_10 = 1;
pub const L_UINT_TYPE: _bindgen_ty_10 = 2;
pub const L_FLOAT_TYPE: _bindgen_ty_10 = 3;
pub type _bindgen_ty_10 = u32;
#[repr(C)]
#[derive(Copy, Clone)]
pub union Rb_Type {
    pub itype: l_int64,
    pub utype: l_uint64,
    pub ftype: l_float64,
    pub ptype: *mut ::std::os::raw::c_void,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_Rb_Type() {
    assert_eq!(
        ::std::mem::size_of::<Rb_Type>(),
        8usize,
        concat!("Size of: ", stringify!(Rb_Type))
    );
    assert_eq!(
        ::std::mem::align_of::<Rb_Type>(),
        8usize,
        concat!("Alignment of ", stringify!(Rb_Type))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Rb_Type>())).itype as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Rb_Type),
            "::",
            stringify!(itype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Rb_Type>())).utype as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Rb_Type),
            "::",
            stringify!(utype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Rb_Type>())).ftype as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Rb_Type),
            "::",
            stringify!(ftype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Rb_Type>())).ptype as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Rb_Type),
            "::",
            stringify!(ptype)
        )
    );
}
pub type RB_TYPE = Rb_Type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_Rbtree {
    pub root: *mut L_Rbtree_Node,
    pub keytype: l_int32,
}
#[test]
fn bindgen_test_layout_L_Rbtree() {
    assert_eq!(
        ::std::mem::size_of::<L_Rbtree>(),
        16usize,
        concat!("Size of: ", stringify!(L_Rbtree))
    );
    assert_eq!(
        ::std::mem::align_of::<L_Rbtree>(),
        8usize,
        concat!("Alignment of ", stringify!(L_Rbtree))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Rbtree>())).root as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Rbtree),
            "::",
            stringify!(root)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Rbtree>())).keytype as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Rbtree),
            "::",
            stringify!(keytype)
        )
    );
}
pub type L_RBTREE = L_Rbtree;
pub type L_AMAP = L_Rbtree;
pub type L_ASET = L_Rbtree;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct L_Rbtree_Node {
    pub key: Rb_Type,
    pub value: Rb_Type,
    pub left: *mut L_Rbtree_Node,
    pub right: *mut L_Rbtree_Node,
    pub parent: *mut L_Rbtree_Node,
    pub color: l_int32,
}
#[test]
fn bindgen_test_layout_L_Rbtree_Node() {
    assert_eq!(
        ::std::mem::size_of::<L_Rbtree_Node>(),
        48usize,
        concat!("Size of: ", stringify!(L_Rbtree_Node))
    );
    assert_eq!(
        ::std::mem::align_of::<L_Rbtree_Node>(),
        8usize,
        concat!("Alignment of ", stringify!(L_Rbtree_Node))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Rbtree_Node>())).key as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Rbtree_Node),
            "::",
            stringify!(key)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Rbtree_Node>())).value as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Rbtree_Node),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Rbtree_Node>())).left as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Rbtree_Node),
            "::",
            stringify!(left)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Rbtree_Node>())).right as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Rbtree_Node),
            "::",
            stringify!(right)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Rbtree_Node>())).parent as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Rbtree_Node),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Rbtree_Node>())).color as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Rbtree_Node),
            "::",
            stringify!(color)
        )
    );
}
pub type L_RBTREE_NODE = L_Rbtree_Node;
pub type L_AMAP_NODE = L_Rbtree_Node;
pub type L_ASET_NODE = L_Rbtree_Node;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_Stack {
    pub nalloc: l_int32,
    pub n: l_int32,
    pub array: *mut *mut ::std::os::raw::c_void,
    pub auxstack: *mut L_Stack,
}
#[test]
fn bindgen_test_layout_L_Stack() {
    assert_eq!(
        ::std::mem::size_of::<L_Stack>(),
        24usize,
        concat!("Size of: ", stringify!(L_Stack))
    );
    assert_eq!(
        ::std::mem::align_of::<L_Stack>(),
        8usize,
        concat!("Alignment of ", stringify!(L_Stack))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Stack>())).nalloc as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Stack),
            "::",
            stringify!(nalloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Stack>())).n as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Stack),
            "::",
            stringify!(n)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Stack>())).array as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Stack),
            "::",
            stringify!(array)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Stack>())).auxstack as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Stack),
            "::",
            stringify!(auxstack)
        )
    );
}
pub type L_STACK = L_Stack;
pub const SPLIT_ON_LEADING_WHITE: _bindgen_ty_11 = 1;
pub const SPLIT_ON_BLANK_LINE: _bindgen_ty_11 = 2;
pub const SPLIT_ON_BOTH: _bindgen_ty_11 = 3;
pub type _bindgen_ty_11 = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_Bmf {
    pub pixa: *mut Pixa,
    pub size: l_int32,
    pub directory: *mut ::std::os::raw::c_char,
    pub baseline1: l_int32,
    pub baseline2: l_int32,
    pub baseline3: l_int32,
    pub lineheight: l_int32,
    pub kernwidth: l_int32,
    pub spacewidth: l_int32,
    pub vertlinesep: l_int32,
    pub fonttab: *mut l_int32,
    pub baselinetab: *mut l_int32,
    pub widthtab: *mut l_int32,
}
#[test]
fn bindgen_test_layout_L_Bmf() {
    assert_eq!(
        ::std::mem::size_of::<L_Bmf>(),
        80usize,
        concat!("Size of: ", stringify!(L_Bmf))
    );
    assert_eq!(
        ::std::mem::align_of::<L_Bmf>(),
        8usize,
        concat!("Alignment of ", stringify!(L_Bmf))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Bmf>())).pixa as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Bmf),
            "::",
            stringify!(pixa)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Bmf>())).size as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Bmf),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Bmf>())).directory as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Bmf),
            "::",
            stringify!(directory)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Bmf>())).baseline1 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Bmf),
            "::",
            stringify!(baseline1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Bmf>())).baseline2 as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Bmf),
            "::",
            stringify!(baseline2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Bmf>())).baseline3 as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Bmf),
            "::",
            stringify!(baseline3)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Bmf>())).lineheight as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Bmf),
            "::",
            stringify!(lineheight)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Bmf>())).kernwidth as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Bmf),
            "::",
            stringify!(kernwidth)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Bmf>())).spacewidth as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Bmf),
            "::",
            stringify!(spacewidth)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Bmf>())).vertlinesep as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Bmf),
            "::",
            stringify!(vertlinesep)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Bmf>())).fonttab as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Bmf),
            "::",
            stringify!(fonttab)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Bmf>())).baselinetab as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Bmf),
            "::",
            stringify!(baselinetab)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Bmf>())).widthtab as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Bmf),
            "::",
            stringify!(widthtab)
        )
    );
}
pub type L_BMF = L_Bmf;
pub const CCB_LOCAL_COORDS: _bindgen_ty_12 = 1;
pub const CCB_GLOBAL_COORDS: _bindgen_ty_12 = 2;
pub type _bindgen_ty_12 = u32;
pub const CCB_SAVE_ALL_PTS: _bindgen_ty_13 = 1;
pub const CCB_SAVE_TURNING_PTS: _bindgen_ty_13 = 2;
pub type _bindgen_ty_13 = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CCBord {
    pub pix: *mut Pix,
    pub boxa: *mut Boxa,
    pub start: *mut Pta,
    pub refcount: l_int32,
    pub local: *mut Ptaa,
    pub global: *mut Ptaa,
    pub step: *mut Numaa,
    pub splocal: *mut Pta,
    pub spglobal: *mut Pta,
}
#[test]
fn bindgen_test_layout_CCBord() {
    assert_eq!(
        ::std::mem::size_of::<CCBord>(),
        72usize,
        concat!("Size of: ", stringify!(CCBord))
    );
    assert_eq!(
        ::std::mem::align_of::<CCBord>(),
        8usize,
        concat!("Alignment of ", stringify!(CCBord))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CCBord>())).pix as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CCBord),
            "::",
            stringify!(pix)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CCBord>())).boxa as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CCBord),
            "::",
            stringify!(boxa)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CCBord>())).start as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(CCBord),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CCBord>())).refcount as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(CCBord),
            "::",
            stringify!(refcount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CCBord>())).local as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(CCBord),
            "::",
            stringify!(local)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CCBord>())).global as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(CCBord),
            "::",
            stringify!(global)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CCBord>())).step as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(CCBord),
            "::",
            stringify!(step)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CCBord>())).splocal as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(CCBord),
            "::",
            stringify!(splocal)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CCBord>())).spglobal as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(CCBord),
            "::",
            stringify!(spglobal)
        )
    );
}
pub type CCBORD = CCBord;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CCBorda {
    pub pix: *mut Pix,
    pub w: l_int32,
    pub h: l_int32,
    pub n: l_int32,
    pub nalloc: l_int32,
    pub ccb: *mut *mut CCBord,
}
#[test]
fn bindgen_test_layout_CCBorda() {
    assert_eq!(
        ::std::mem::size_of::<CCBorda>(),
        32usize,
        concat!("Size of: ", stringify!(CCBorda))
    );
    assert_eq!(
        ::std::mem::align_of::<CCBorda>(),
        8usize,
        concat!("Alignment of ", stringify!(CCBorda))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CCBorda>())).pix as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CCBorda),
            "::",
            stringify!(pix)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CCBorda>())).w as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CCBorda),
            "::",
            stringify!(w)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CCBorda>())).h as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(CCBorda),
            "::",
            stringify!(h)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CCBorda>())).n as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(CCBorda),
            "::",
            stringify!(n)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CCBorda>())).nalloc as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(CCBorda),
            "::",
            stringify!(nalloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CCBorda>())).ccb as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(CCBorda),
            "::",
            stringify!(ccb)
        )
    );
}
pub type CCBORDA = CCBorda;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_Dewarpa {
    pub nalloc: l_int32,
    pub maxpage: l_int32,
    pub dewarp: *mut *mut L_Dewarp,
    pub dewarpcache: *mut *mut L_Dewarp,
    pub namodels: *mut Numa,
    pub napages: *mut Numa,
    pub redfactor: l_int32,
    pub sampling: l_int32,
    pub minlines: l_int32,
    pub maxdist: l_int32,
    pub max_linecurv: l_int32,
    pub min_diff_linecurv: l_int32,
    pub max_diff_linecurv: l_int32,
    pub max_edgeslope: l_int32,
    pub max_edgecurv: l_int32,
    pub max_diff_edgecurv: l_int32,
    pub useboth: l_int32,
    pub check_columns: l_int32,
    pub modelsready: l_int32,
}
#[test]
fn bindgen_test_layout_L_Dewarpa() {
    assert_eq!(
        ::std::mem::size_of::<L_Dewarpa>(),
        96usize,
        concat!("Size of: ", stringify!(L_Dewarpa))
    );
    assert_eq!(
        ::std::mem::align_of::<L_Dewarpa>(),
        8usize,
        concat!("Alignment of ", stringify!(L_Dewarpa))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarpa>())).nalloc as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarpa),
            "::",
            stringify!(nalloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarpa>())).maxpage as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarpa),
            "::",
            stringify!(maxpage)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarpa>())).dewarp as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarpa),
            "::",
            stringify!(dewarp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarpa>())).dewarpcache as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarpa),
            "::",
            stringify!(dewarpcache)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarpa>())).namodels as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarpa),
            "::",
            stringify!(namodels)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarpa>())).napages as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarpa),
            "::",
            stringify!(napages)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarpa>())).redfactor as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarpa),
            "::",
            stringify!(redfactor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarpa>())).sampling as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarpa),
            "::",
            stringify!(sampling)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarpa>())).minlines as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarpa),
            "::",
            stringify!(minlines)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarpa>())).maxdist as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarpa),
            "::",
            stringify!(maxdist)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarpa>())).max_linecurv as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarpa),
            "::",
            stringify!(max_linecurv)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarpa>())).min_diff_linecurv as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarpa),
            "::",
            stringify!(min_diff_linecurv)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarpa>())).max_diff_linecurv as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarpa),
            "::",
            stringify!(max_diff_linecurv)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarpa>())).max_edgeslope as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarpa),
            "::",
            stringify!(max_edgeslope)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarpa>())).max_edgecurv as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarpa),
            "::",
            stringify!(max_edgecurv)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarpa>())).max_diff_edgecurv as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarpa),
            "::",
            stringify!(max_diff_edgecurv)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarpa>())).useboth as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarpa),
            "::",
            stringify!(useboth)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarpa>())).check_columns as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarpa),
            "::",
            stringify!(check_columns)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarpa>())).modelsready as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarpa),
            "::",
            stringify!(modelsready)
        )
    );
}
pub type L_DEWARPA = L_Dewarpa;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_Dewarp {
    pub dewa: *mut L_Dewarpa,
    pub pixs: *mut Pix,
    pub sampvdispar: *mut FPix,
    pub samphdispar: *mut FPix,
    pub sampydispar: *mut FPix,
    pub fullvdispar: *mut FPix,
    pub fullhdispar: *mut FPix,
    pub fullydispar: *mut FPix,
    pub namidys: *mut Numa,
    pub nacurves: *mut Numa,
    pub w: l_int32,
    pub h: l_int32,
    pub pageno: l_int32,
    pub sampling: l_int32,
    pub redfactor: l_int32,
    pub minlines: l_int32,
    pub nlines: l_int32,
    pub mincurv: l_int32,
    pub maxcurv: l_int32,
    pub leftslope: l_int32,
    pub rightslope: l_int32,
    pub leftcurv: l_int32,
    pub rightcurv: l_int32,
    pub nx: l_int32,
    pub ny: l_int32,
    pub hasref: l_int32,
    pub refpage: l_int32,
    pub vsuccess: l_int32,
    pub hsuccess: l_int32,
    pub ysuccess: l_int32,
    pub vvalid: l_int32,
    pub hvalid: l_int32,
    pub skip_horiz: l_int32,
    pub debug: l_int32,
}
#[test]
fn bindgen_test_layout_L_Dewarp() {
    assert_eq!(
        ::std::mem::size_of::<L_Dewarp>(),
        176usize,
        concat!("Size of: ", stringify!(L_Dewarp))
    );
    assert_eq!(
        ::std::mem::align_of::<L_Dewarp>(),
        8usize,
        concat!("Alignment of ", stringify!(L_Dewarp))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarp>())).dewa as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarp),
            "::",
            stringify!(dewa)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarp>())).pixs as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarp),
            "::",
            stringify!(pixs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarp>())).sampvdispar as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarp),
            "::",
            stringify!(sampvdispar)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarp>())).samphdispar as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarp),
            "::",
            stringify!(samphdispar)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarp>())).sampydispar as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarp),
            "::",
            stringify!(sampydispar)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarp>())).fullvdispar as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarp),
            "::",
            stringify!(fullvdispar)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarp>())).fullhdispar as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarp),
            "::",
            stringify!(fullhdispar)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarp>())).fullydispar as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarp),
            "::",
            stringify!(fullydispar)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarp>())).namidys as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarp),
            "::",
            stringify!(namidys)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarp>())).nacurves as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarp),
            "::",
            stringify!(nacurves)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarp>())).w as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarp),
            "::",
            stringify!(w)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarp>())).h as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarp),
            "::",
            stringify!(h)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarp>())).pageno as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarp),
            "::",
            stringify!(pageno)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarp>())).sampling as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarp),
            "::",
            stringify!(sampling)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarp>())).redfactor as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarp),
            "::",
            stringify!(redfactor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarp>())).minlines as *const _ as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarp),
            "::",
            stringify!(minlines)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarp>())).nlines as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarp),
            "::",
            stringify!(nlines)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarp>())).mincurv as *const _ as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarp),
            "::",
            stringify!(mincurv)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarp>())).maxcurv as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarp),
            "::",
            stringify!(maxcurv)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarp>())).leftslope as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarp),
            "::",
            stringify!(leftslope)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarp>())).rightslope as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarp),
            "::",
            stringify!(rightslope)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarp>())).leftcurv as *const _ as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarp),
            "::",
            stringify!(leftcurv)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarp>())).rightcurv as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarp),
            "::",
            stringify!(rightcurv)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarp>())).nx as *const _ as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarp),
            "::",
            stringify!(nx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarp>())).ny as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarp),
            "::",
            stringify!(ny)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarp>())).hasref as *const _ as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarp),
            "::",
            stringify!(hasref)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarp>())).refpage as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarp),
            "::",
            stringify!(refpage)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarp>())).vsuccess as *const _ as usize },
        148usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarp),
            "::",
            stringify!(vsuccess)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarp>())).hsuccess as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarp),
            "::",
            stringify!(hsuccess)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarp>())).ysuccess as *const _ as usize },
        156usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarp),
            "::",
            stringify!(ysuccess)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarp>())).vvalid as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarp),
            "::",
            stringify!(vvalid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarp>())).hvalid as *const _ as usize },
        164usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarp),
            "::",
            stringify!(hvalid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarp>())).skip_horiz as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarp),
            "::",
            stringify!(skip_horiz)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Dewarp>())).debug as *const _ as usize },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Dewarp),
            "::",
            stringify!(debug)
        )
    );
}
pub type L_DEWARP = L_Dewarp;
pub const GPLOT_STYLE_GPLOT_LINES: GPLOT_STYLE = 0;
pub const GPLOT_STYLE_GPLOT_POINTS: GPLOT_STYLE = 1;
pub const GPLOT_STYLE_GPLOT_IMPULSES: GPLOT_STYLE = 2;
pub const GPLOT_STYLE_GPLOT_LINESPOINTS: GPLOT_STYLE = 3;
pub const GPLOT_STYLE_GPLOT_DOTS: GPLOT_STYLE = 4;
pub type GPLOT_STYLE = u32;
pub const GPLOT_OUTPUT_GPLOT_NONE: GPLOT_OUTPUT = 0;
pub const GPLOT_OUTPUT_GPLOT_PNG: GPLOT_OUTPUT = 1;
pub const GPLOT_OUTPUT_GPLOT_PS: GPLOT_OUTPUT = 2;
pub const GPLOT_OUTPUT_GPLOT_EPS: GPLOT_OUTPUT = 3;
pub const GPLOT_OUTPUT_GPLOT_LATEX: GPLOT_OUTPUT = 4;
pub type GPLOT_OUTPUT = u32;
pub const GPLOT_SCALING_GPLOT_LINEAR_SCALE: GPLOT_SCALING = 0;
pub const GPLOT_SCALING_GPLOT_LOG_SCALE_X: GPLOT_SCALING = 1;
pub const GPLOT_SCALING_GPLOT_LOG_SCALE_Y: GPLOT_SCALING = 2;
pub const GPLOT_SCALING_GPLOT_LOG_SCALE_X_Y: GPLOT_SCALING = 3;
pub type GPLOT_SCALING = u32;
extern "C" {
    pub static mut gplotstylenames: [*const ::std::os::raw::c_char; 0usize];
}
extern "C" {
    pub static mut gplotfileoutputs: [*const ::std::os::raw::c_char; 0usize];
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GPlot {
    pub rootname: *mut ::std::os::raw::c_char,
    pub cmdname: *mut ::std::os::raw::c_char,
    pub cmddata: *mut Sarray,
    pub datanames: *mut Sarray,
    pub plotdata: *mut Sarray,
    pub plottitles: *mut Sarray,
    pub plotstyles: *mut Numa,
    pub nplots: l_int32,
    pub outname: *mut ::std::os::raw::c_char,
    pub outformat: l_int32,
    pub scaling: l_int32,
    pub title: *mut ::std::os::raw::c_char,
    pub xlabel: *mut ::std::os::raw::c_char,
    pub ylabel: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_GPlot() {
    assert_eq!(
        ::std::mem::size_of::<GPlot>(),
        104usize,
        concat!("Size of: ", stringify!(GPlot))
    );
    assert_eq!(
        ::std::mem::align_of::<GPlot>(),
        8usize,
        concat!("Alignment of ", stringify!(GPlot))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GPlot>())).rootname as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GPlot),
            "::",
            stringify!(rootname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GPlot>())).cmdname as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GPlot),
            "::",
            stringify!(cmdname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GPlot>())).cmddata as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(GPlot),
            "::",
            stringify!(cmddata)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GPlot>())).datanames as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(GPlot),
            "::",
            stringify!(datanames)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GPlot>())).plotdata as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(GPlot),
            "::",
            stringify!(plotdata)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GPlot>())).plottitles as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(GPlot),
            "::",
            stringify!(plottitles)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GPlot>())).plotstyles as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(GPlot),
            "::",
            stringify!(plotstyles)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GPlot>())).nplots as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(GPlot),
            "::",
            stringify!(nplots)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GPlot>())).outname as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(GPlot),
            "::",
            stringify!(outname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GPlot>())).outformat as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(GPlot),
            "::",
            stringify!(outformat)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GPlot>())).scaling as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(GPlot),
            "::",
            stringify!(scaling)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GPlot>())).title as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(GPlot),
            "::",
            stringify!(title)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GPlot>())).xlabel as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(GPlot),
            "::",
            stringify!(xlabel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GPlot>())).ylabel as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(GPlot),
            "::",
            stringify!(ylabel)
        )
    );
}
pub type GPLOT = GPlot;
pub const IFF_UNKNOWN: _bindgen_ty_14 = 0;
pub const IFF_BMP: _bindgen_ty_14 = 1;
pub const IFF_JFIF_JPEG: _bindgen_ty_14 = 2;
pub const IFF_PNG: _bindgen_ty_14 = 3;
pub const IFF_TIFF: _bindgen_ty_14 = 4;
pub const IFF_TIFF_PACKBITS: _bindgen_ty_14 = 5;
pub const IFF_TIFF_RLE: _bindgen_ty_14 = 6;
pub const IFF_TIFF_G3: _bindgen_ty_14 = 7;
pub const IFF_TIFF_G4: _bindgen_ty_14 = 8;
pub const IFF_TIFF_LZW: _bindgen_ty_14 = 9;
pub const IFF_TIFF_ZIP: _bindgen_ty_14 = 10;
pub const IFF_PNM: _bindgen_ty_14 = 11;
pub const IFF_PS: _bindgen_ty_14 = 12;
pub const IFF_GIF: _bindgen_ty_14 = 13;
pub const IFF_JP2: _bindgen_ty_14 = 14;
pub const IFF_WEBP: _bindgen_ty_14 = 15;
pub const IFF_LPDF: _bindgen_ty_14 = 16;
pub const IFF_DEFAULT: _bindgen_ty_14 = 17;
pub const IFF_SPIX: _bindgen_ty_14 = 18;
pub type _bindgen_ty_14 = u32;
pub const L_JPEG_READ_LUMINANCE: _bindgen_ty_16 = 1;
pub const L_JPEG_FAIL_ON_BAD_DATA: _bindgen_ty_16 = 2;
pub type _bindgen_ty_16 = u32;
pub const L_DEFAULT_ENCODE: _bindgen_ty_17 = 0;
pub const L_JPEG_ENCODE: _bindgen_ty_17 = 1;
pub const L_G4_ENCODE: _bindgen_ty_17 = 2;
pub const L_FLATE_ENCODE: _bindgen_ty_17 = 3;
pub const L_JP2K_ENCODE: _bindgen_ty_17 = 4;
pub type _bindgen_ty_17 = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_Compressed_Data {
    pub type_: l_int32,
    pub datacomp: *mut l_uint8,
    pub nbytescomp: usize,
    pub data85: *mut ::std::os::raw::c_char,
    pub nbytes85: usize,
    pub cmapdata85: *mut ::std::os::raw::c_char,
    pub cmapdatahex: *mut ::std::os::raw::c_char,
    pub ncolors: l_int32,
    pub w: l_int32,
    pub h: l_int32,
    pub bps: l_int32,
    pub spp: l_int32,
    pub minisblack: l_int32,
    pub predictor: l_int32,
    pub nbytes: usize,
    pub res: l_int32,
}
#[test]
fn bindgen_test_layout_L_Compressed_Data() {
    assert_eq!(
        ::std::mem::size_of::<L_Compressed_Data>(),
        104usize,
        concat!("Size of: ", stringify!(L_Compressed_Data))
    );
    assert_eq!(
        ::std::mem::align_of::<L_Compressed_Data>(),
        8usize,
        concat!("Alignment of ", stringify!(L_Compressed_Data))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Compressed_Data>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Compressed_Data),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Compressed_Data>())).datacomp as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Compressed_Data),
            "::",
            stringify!(datacomp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Compressed_Data>())).nbytescomp as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Compressed_Data),
            "::",
            stringify!(nbytescomp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Compressed_Data>())).data85 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Compressed_Data),
            "::",
            stringify!(data85)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Compressed_Data>())).nbytes85 as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Compressed_Data),
            "::",
            stringify!(nbytes85)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Compressed_Data>())).cmapdata85 as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Compressed_Data),
            "::",
            stringify!(cmapdata85)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Compressed_Data>())).cmapdatahex as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Compressed_Data),
            "::",
            stringify!(cmapdatahex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Compressed_Data>())).ncolors as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Compressed_Data),
            "::",
            stringify!(ncolors)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Compressed_Data>())).w as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Compressed_Data),
            "::",
            stringify!(w)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Compressed_Data>())).h as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Compressed_Data),
            "::",
            stringify!(h)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Compressed_Data>())).bps as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Compressed_Data),
            "::",
            stringify!(bps)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Compressed_Data>())).spp as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Compressed_Data),
            "::",
            stringify!(spp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Compressed_Data>())).minisblack as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Compressed_Data),
            "::",
            stringify!(minisblack)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Compressed_Data>())).predictor as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Compressed_Data),
            "::",
            stringify!(predictor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Compressed_Data>())).nbytes as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Compressed_Data),
            "::",
            stringify!(nbytes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Compressed_Data>())).res as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Compressed_Data),
            "::",
            stringify!(res)
        )
    );
}
pub type L_COMP_DATA = L_Compressed_Data;
pub const L_FIRST_IMAGE: _bindgen_ty_18 = 1;
pub const L_NEXT_IMAGE: _bindgen_ty_18 = 2;
pub const L_LAST_IMAGE: _bindgen_ty_18 = 3;
pub type _bindgen_ty_18 = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_Pdf_Data {
    pub title: *mut ::std::os::raw::c_char,
    pub n: l_int32,
    pub ncmap: l_int32,
    pub cida: *mut L_Ptra,
    pub id: *mut ::std::os::raw::c_char,
    pub obj1: *mut ::std::os::raw::c_char,
    pub obj2: *mut ::std::os::raw::c_char,
    pub obj3: *mut ::std::os::raw::c_char,
    pub obj4: *mut ::std::os::raw::c_char,
    pub obj5: *mut ::std::os::raw::c_char,
    pub poststream: *mut ::std::os::raw::c_char,
    pub trailer: *mut ::std::os::raw::c_char,
    pub xy: *mut Pta,
    pub wh: *mut Pta,
    pub mediabox: *mut Box,
    pub saprex: *mut Sarray,
    pub sacmap: *mut Sarray,
    pub objsize: *mut L_Dna,
    pub objloc: *mut L_Dna,
    pub xrefloc: l_int32,
}
#[test]
fn bindgen_test_layout_L_Pdf_Data() {
    assert_eq!(
        ::std::mem::size_of::<L_Pdf_Data>(),
        152usize,
        concat!("Size of: ", stringify!(L_Pdf_Data))
    );
    assert_eq!(
        ::std::mem::align_of::<L_Pdf_Data>(),
        8usize,
        concat!("Alignment of ", stringify!(L_Pdf_Data))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Pdf_Data>())).title as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Pdf_Data),
            "::",
            stringify!(title)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Pdf_Data>())).n as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Pdf_Data),
            "::",
            stringify!(n)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Pdf_Data>())).ncmap as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Pdf_Data),
            "::",
            stringify!(ncmap)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Pdf_Data>())).cida as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Pdf_Data),
            "::",
            stringify!(cida)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Pdf_Data>())).id as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Pdf_Data),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Pdf_Data>())).obj1 as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Pdf_Data),
            "::",
            stringify!(obj1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Pdf_Data>())).obj2 as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Pdf_Data),
            "::",
            stringify!(obj2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Pdf_Data>())).obj3 as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Pdf_Data),
            "::",
            stringify!(obj3)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Pdf_Data>())).obj4 as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Pdf_Data),
            "::",
            stringify!(obj4)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Pdf_Data>())).obj5 as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Pdf_Data),
            "::",
            stringify!(obj5)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Pdf_Data>())).poststream as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Pdf_Data),
            "::",
            stringify!(poststream)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Pdf_Data>())).trailer as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Pdf_Data),
            "::",
            stringify!(trailer)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Pdf_Data>())).xy as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Pdf_Data),
            "::",
            stringify!(xy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Pdf_Data>())).wh as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Pdf_Data),
            "::",
            stringify!(wh)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Pdf_Data>())).mediabox as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Pdf_Data),
            "::",
            stringify!(mediabox)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Pdf_Data>())).saprex as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Pdf_Data),
            "::",
            stringify!(saprex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Pdf_Data>())).sacmap as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Pdf_Data),
            "::",
            stringify!(sacmap)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Pdf_Data>())).objsize as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Pdf_Data),
            "::",
            stringify!(objsize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Pdf_Data>())).objloc as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Pdf_Data),
            "::",
            stringify!(objloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Pdf_Data>())).xrefloc as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Pdf_Data),
            "::",
            stringify!(xrefloc)
        )
    );
}
pub type L_PDF_DATA = L_Pdf_Data;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JbClasser {
    pub safiles: *mut Sarray,
    pub method: l_int32,
    pub components: l_int32,
    pub maxwidth: l_int32,
    pub maxheight: l_int32,
    pub npages: l_int32,
    pub baseindex: l_int32,
    pub nacomps: *mut Numa,
    pub sizehaus: l_int32,
    pub rankhaus: l_float32,
    pub thresh: l_float32,
    pub weightfactor: l_float32,
    pub naarea: *mut Numa,
    pub w: l_int32,
    pub h: l_int32,
    pub nclass: l_int32,
    pub keep_pixaa: l_int32,
    pub pixaa: *mut Pixaa,
    pub pixat: *mut Pixa,
    pub pixatd: *mut Pixa,
    pub dahash: *mut L_DnaHash,
    pub nafgt: *mut Numa,
    pub ptac: *mut Pta,
    pub ptact: *mut Pta,
    pub naclass: *mut Numa,
    pub napage: *mut Numa,
    pub ptaul: *mut Pta,
    pub ptall: *mut Pta,
}
#[test]
fn bindgen_test_layout_JbClasser() {
    assert_eq!(
        ::std::mem::size_of::<JbClasser>(),
        168usize,
        concat!("Size of: ", stringify!(JbClasser))
    );
    assert_eq!(
        ::std::mem::align_of::<JbClasser>(),
        8usize,
        concat!("Alignment of ", stringify!(JbClasser))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JbClasser>())).safiles as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JbClasser),
            "::",
            stringify!(safiles)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JbClasser>())).method as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JbClasser),
            "::",
            stringify!(method)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JbClasser>())).components as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(JbClasser),
            "::",
            stringify!(components)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JbClasser>())).maxwidth as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(JbClasser),
            "::",
            stringify!(maxwidth)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JbClasser>())).maxheight as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(JbClasser),
            "::",
            stringify!(maxheight)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JbClasser>())).npages as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(JbClasser),
            "::",
            stringify!(npages)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JbClasser>())).baseindex as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(JbClasser),
            "::",
            stringify!(baseindex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JbClasser>())).nacomps as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(JbClasser),
            "::",
            stringify!(nacomps)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JbClasser>())).sizehaus as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(JbClasser),
            "::",
            stringify!(sizehaus)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JbClasser>())).rankhaus as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(JbClasser),
            "::",
            stringify!(rankhaus)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JbClasser>())).thresh as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(JbClasser),
            "::",
            stringify!(thresh)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JbClasser>())).weightfactor as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(JbClasser),
            "::",
            stringify!(weightfactor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JbClasser>())).naarea as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(JbClasser),
            "::",
            stringify!(naarea)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JbClasser>())).w as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(JbClasser),
            "::",
            stringify!(w)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JbClasser>())).h as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(JbClasser),
            "::",
            stringify!(h)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JbClasser>())).nclass as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(JbClasser),
            "::",
            stringify!(nclass)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JbClasser>())).keep_pixaa as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(JbClasser),
            "::",
            stringify!(keep_pixaa)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JbClasser>())).pixaa as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(JbClasser),
            "::",
            stringify!(pixaa)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JbClasser>())).pixat as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(JbClasser),
            "::",
            stringify!(pixat)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JbClasser>())).pixatd as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(JbClasser),
            "::",
            stringify!(pixatd)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JbClasser>())).dahash as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(JbClasser),
            "::",
            stringify!(dahash)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JbClasser>())).nafgt as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(JbClasser),
            "::",
            stringify!(nafgt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JbClasser>())).ptac as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(JbClasser),
            "::",
            stringify!(ptac)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JbClasser>())).ptact as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(JbClasser),
            "::",
            stringify!(ptact)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JbClasser>())).naclass as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(JbClasser),
            "::",
            stringify!(naclass)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JbClasser>())).napage as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(JbClasser),
            "::",
            stringify!(napage)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JbClasser>())).ptaul as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(JbClasser),
            "::",
            stringify!(ptaul)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JbClasser>())).ptall as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(JbClasser),
            "::",
            stringify!(ptall)
        )
    );
}
pub type JBCLASSER = JbClasser;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JbData {
    pub pix: *mut Pix,
    pub npages: l_int32,
    pub w: l_int32,
    pub h: l_int32,
    pub nclass: l_int32,
    pub latticew: l_int32,
    pub latticeh: l_int32,
    pub naclass: *mut Numa,
    pub napage: *mut Numa,
    pub ptaul: *mut Pta,
}
#[test]
fn bindgen_test_layout_JbData() {
    assert_eq!(
        ::std::mem::size_of::<JbData>(),
        56usize,
        concat!("Size of: ", stringify!(JbData))
    );
    assert_eq!(
        ::std::mem::align_of::<JbData>(),
        8usize,
        concat!("Alignment of ", stringify!(JbData))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JbData>())).pix as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JbData),
            "::",
            stringify!(pix)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JbData>())).npages as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JbData),
            "::",
            stringify!(npages)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JbData>())).w as *const _ as usize },
        12usize,
        concat!("Offset of field: ", stringify!(JbData), "::", stringify!(w))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JbData>())).h as *const _ as usize },
        16usize,
        concat!("Offset of field: ", stringify!(JbData), "::", stringify!(h))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JbData>())).nclass as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(JbData),
            "::",
            stringify!(nclass)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JbData>())).latticew as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(JbData),
            "::",
            stringify!(latticew)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JbData>())).latticeh as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(JbData),
            "::",
            stringify!(latticeh)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JbData>())).naclass as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(JbData),
            "::",
            stringify!(naclass)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JbData>())).napage as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(JbData),
            "::",
            stringify!(napage)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JbData>())).ptaul as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(JbData),
            "::",
            stringify!(ptaul)
        )
    );
}
pub type JBDATA = JbData;
pub const JB_RANKHAUS: _bindgen_ty_19 = 0;
pub const JB_CORRELATION: _bindgen_ty_19 = 1;
pub type _bindgen_ty_19 = u32;
pub const JB_CONN_COMPS: _bindgen_ty_20 = 0;
pub const JB_CHARACTERS: _bindgen_ty_20 = 1;
pub const JB_WORDS: _bindgen_ty_20 = 2;
pub type _bindgen_ty_20 = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Sel {
    pub sy: l_int32,
    pub sx: l_int32,
    pub cy: l_int32,
    pub cx: l_int32,
    pub data: *mut *mut l_int32,
    pub name: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_Sel() {
    assert_eq!(
        ::std::mem::size_of::<Sel>(),
        32usize,
        concat!("Size of: ", stringify!(Sel))
    );
    assert_eq!(
        ::std::mem::align_of::<Sel>(),
        8usize,
        concat!("Alignment of ", stringify!(Sel))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Sel>())).sy as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(Sel), "::", stringify!(sy))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Sel>())).sx as *const _ as usize },
        4usize,
        concat!("Offset of field: ", stringify!(Sel), "::", stringify!(sx))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Sel>())).cy as *const _ as usize },
        8usize,
        concat!("Offset of field: ", stringify!(Sel), "::", stringify!(cy))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Sel>())).cx as *const _ as usize },
        12usize,
        concat!("Offset of field: ", stringify!(Sel), "::", stringify!(cx))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Sel>())).data as *const _ as usize },
        16usize,
        concat!("Offset of field: ", stringify!(Sel), "::", stringify!(data))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Sel>())).name as *const _ as usize },
        24usize,
        concat!("Offset of field: ", stringify!(Sel), "::", stringify!(name))
    );
}
pub type SEL = Sel;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Sela {
    pub n: l_int32,
    pub nalloc: l_int32,
    pub sel: *mut *mut Sel,
}
#[test]
fn bindgen_test_layout_Sela() {
    assert_eq!(
        ::std::mem::size_of::<Sela>(),
        16usize,
        concat!("Size of: ", stringify!(Sela))
    );
    assert_eq!(
        ::std::mem::align_of::<Sela>(),
        8usize,
        concat!("Alignment of ", stringify!(Sela))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Sela>())).n as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(Sela), "::", stringify!(n))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Sela>())).nalloc as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Sela),
            "::",
            stringify!(nalloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Sela>())).sel as *const _ as usize },
        8usize,
        concat!("Offset of field: ", stringify!(Sela), "::", stringify!(sel))
    );
}
pub type SELA = Sela;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_Kernel {
    pub sy: l_int32,
    pub sx: l_int32,
    pub cy: l_int32,
    pub cx: l_int32,
    pub data: *mut *mut l_float32,
}
#[test]
fn bindgen_test_layout_L_Kernel() {
    assert_eq!(
        ::std::mem::size_of::<L_Kernel>(),
        24usize,
        concat!("Size of: ", stringify!(L_Kernel))
    );
    assert_eq!(
        ::std::mem::align_of::<L_Kernel>(),
        8usize,
        concat!("Alignment of ", stringify!(L_Kernel))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Kernel>())).sy as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Kernel),
            "::",
            stringify!(sy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Kernel>())).sx as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Kernel),
            "::",
            stringify!(sx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Kernel>())).cy as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Kernel),
            "::",
            stringify!(cy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Kernel>())).cx as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Kernel),
            "::",
            stringify!(cx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Kernel>())).data as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Kernel),
            "::",
            stringify!(data)
        )
    );
}
pub type L_KERNEL = L_Kernel;
pub const SEL_DONT_CARE: _bindgen_ty_22 = 0;
pub const SEL_HIT: _bindgen_ty_22 = 1;
pub const SEL_MISS: _bindgen_ty_22 = 2;
pub type _bindgen_ty_22 = u32;
pub const L_RUN_OFF: _bindgen_ty_23 = 0;
pub const L_RUN_ON: _bindgen_ty_23 = 1;
pub type _bindgen_ty_23 = u32;
pub const L_HORIZ: _bindgen_ty_24 = 1;
pub const L_VERT: _bindgen_ty_24 = 2;
pub const L_BOTH_DIRECTIONS: _bindgen_ty_24 = 3;
pub type _bindgen_ty_24 = u32;
pub const L_MORPH_DILATE: _bindgen_ty_25 = 1;
pub const L_MORPH_ERODE: _bindgen_ty_25 = 2;
pub const L_MORPH_OPEN: _bindgen_ty_25 = 3;
pub const L_MORPH_CLOSE: _bindgen_ty_25 = 4;
pub const L_MORPH_HMT: _bindgen_ty_25 = 5;
pub type _bindgen_ty_25 = u32;
pub const L_LINEAR_SCALE: _bindgen_ty_26 = 1;
pub const L_LOG_SCALE: _bindgen_ty_26 = 2;
pub type _bindgen_ty_26 = u32;
pub const L_TOPHAT_WHITE: _bindgen_ty_27 = 0;
pub const L_TOPHAT_BLACK: _bindgen_ty_27 = 1;
pub type _bindgen_ty_27 = u32;
pub const L_ARITH_ADD: _bindgen_ty_28 = 1;
pub const L_ARITH_SUBTRACT: _bindgen_ty_28 = 2;
pub const L_ARITH_MULTIPLY: _bindgen_ty_28 = 3;
pub const L_ARITH_DIVIDE: _bindgen_ty_28 = 4;
pub const L_UNION: _bindgen_ty_28 = 5;
pub const L_INTERSECTION: _bindgen_ty_28 = 6;
pub const L_SUBTRACTION: _bindgen_ty_28 = 7;
pub const L_EXCLUSIVE_OR: _bindgen_ty_28 = 8;
pub type _bindgen_ty_28 = u32;
pub const L_CHOOSE_MIN: _bindgen_ty_29 = 1;
pub const L_CHOOSE_MAX: _bindgen_ty_29 = 2;
pub const L_CHOOSE_MAXDIFF: _bindgen_ty_29 = 3;
pub const L_CHOOSE_MIN_BOOST: _bindgen_ty_29 = 4;
pub const L_CHOOSE_MAX_BOOST: _bindgen_ty_29 = 5;
pub type _bindgen_ty_29 = u32;
pub const L_BOUNDARY_BG: _bindgen_ty_30 = 1;
pub const L_BOUNDARY_FG: _bindgen_ty_30 = 2;
pub type _bindgen_ty_30 = u32;
pub const L_COMPARE_XOR: _bindgen_ty_31 = 1;
pub const L_COMPARE_SUBTRACT: _bindgen_ty_31 = 2;
pub const L_COMPARE_ABS_DIFF: _bindgen_ty_31 = 3;
pub type _bindgen_ty_31 = u32;
pub const L_MAX_DIFF_FROM_AVERAGE_2: _bindgen_ty_32 = 1;
pub const L_MAX_MIN_DIFF_FROM_2: _bindgen_ty_32 = 2;
pub const L_MAX_DIFF: _bindgen_ty_32 = 3;
pub type _bindgen_ty_32 = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Pix {
    pub w: l_uint32,
    pub h: l_uint32,
    pub d: l_uint32,
    pub spp: l_uint32,
    pub wpl: l_uint32,
    pub refcount: l_uint32,
    pub xres: l_int32,
    pub yres: l_int32,
    pub informat: l_int32,
    pub special: l_int32,
    pub text: *mut ::std::os::raw::c_char,
    pub colormap: *mut PixColormap,
    pub data: *mut l_uint32,
}
#[test]
fn bindgen_test_layout_Pix() {
    assert_eq!(
        ::std::mem::size_of::<Pix>(),
        64usize,
        concat!("Size of: ", stringify!(Pix))
    );
    assert_eq!(
        ::std::mem::align_of::<Pix>(),
        8usize,
        concat!("Alignment of ", stringify!(Pix))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Pix>())).w as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(Pix), "::", stringify!(w))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Pix>())).h as *const _ as usize },
        4usize,
        concat!("Offset of field: ", stringify!(Pix), "::", stringify!(h))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Pix>())).d as *const _ as usize },
        8usize,
        concat!("Offset of field: ", stringify!(Pix), "::", stringify!(d))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Pix>())).spp as *const _ as usize },
        12usize,
        concat!("Offset of field: ", stringify!(Pix), "::", stringify!(spp))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Pix>())).wpl as *const _ as usize },
        16usize,
        concat!("Offset of field: ", stringify!(Pix), "::", stringify!(wpl))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Pix>())).refcount as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(Pix),
            "::",
            stringify!(refcount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Pix>())).xres as *const _ as usize },
        24usize,
        concat!("Offset of field: ", stringify!(Pix), "::", stringify!(xres))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Pix>())).yres as *const _ as usize },
        28usize,
        concat!("Offset of field: ", stringify!(Pix), "::", stringify!(yres))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Pix>())).informat as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Pix),
            "::",
            stringify!(informat)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Pix>())).special as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(Pix),
            "::",
            stringify!(special)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Pix>())).text as *const _ as usize },
        40usize,
        concat!("Offset of field: ", stringify!(Pix), "::", stringify!(text))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Pix>())).colormap as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(Pix),
            "::",
            stringify!(colormap)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Pix>())).data as *const _ as usize },
        56usize,
        concat!("Offset of field: ", stringify!(Pix), "::", stringify!(data))
    );
}
pub type PIX = Pix;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PixColormap {
    pub array: *mut ::std::os::raw::c_void,
    pub depth: l_int32,
    pub nalloc: l_int32,
    pub n: l_int32,
}
#[test]
fn bindgen_test_layout_PixColormap() {
    assert_eq!(
        ::std::mem::size_of::<PixColormap>(),
        24usize,
        concat!("Size of: ", stringify!(PixColormap))
    );
    assert_eq!(
        ::std::mem::align_of::<PixColormap>(),
        8usize,
        concat!("Alignment of ", stringify!(PixColormap))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PixColormap>())).array as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PixColormap),
            "::",
            stringify!(array)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PixColormap>())).depth as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(PixColormap),
            "::",
            stringify!(depth)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PixColormap>())).nalloc as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(PixColormap),
            "::",
            stringify!(nalloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PixColormap>())).n as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PixColormap),
            "::",
            stringify!(n)
        )
    );
}
pub type PIXCMAP = PixColormap;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RGBA_Quad {
    pub blue: l_uint8,
    pub green: l_uint8,
    pub red: l_uint8,
    pub alpha: l_uint8,
}
#[test]
fn bindgen_test_layout_RGBA_Quad() {
    assert_eq!(
        ::std::mem::size_of::<RGBA_Quad>(),
        4usize,
        concat!("Size of: ", stringify!(RGBA_Quad))
    );
    assert_eq!(
        ::std::mem::align_of::<RGBA_Quad>(),
        1usize,
        concat!("Alignment of ", stringify!(RGBA_Quad))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RGBA_Quad>())).blue as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RGBA_Quad),
            "::",
            stringify!(blue)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RGBA_Quad>())).green as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(RGBA_Quad),
            "::",
            stringify!(green)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RGBA_Quad>())).red as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(RGBA_Quad),
            "::",
            stringify!(red)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RGBA_Quad>())).alpha as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(RGBA_Quad),
            "::",
            stringify!(alpha)
        )
    );
}
pub type RGBA_QUAD = RGBA_Quad;
pub const COLOR_RED: _bindgen_ty_33 = 0;
pub const COLOR_GREEN: _bindgen_ty_33 = 1;
pub const COLOR_BLUE: _bindgen_ty_33 = 2;
pub const L_ALPHA_CHANNEL: _bindgen_ty_33 = 3;
pub type _bindgen_ty_33 = u32;
pub const L_RED_SHIFT: l_int32 = 24;
pub const L_GREEN_SHIFT: l_int32 = 16;
pub const L_BLUE_SHIFT: l_int32 = 8;
pub const L_ALPHA_SHIFT: l_int32 = 0;
pub const L_DRAW_RED: _bindgen_ty_34 = 0;
pub const L_DRAW_GREEN: _bindgen_ty_34 = 1;
pub const L_DRAW_BLUE: _bindgen_ty_34 = 2;
pub const L_DRAW_SPECIFIED: _bindgen_ty_34 = 3;
pub const L_DRAW_RGB: _bindgen_ty_34 = 4;
pub const L_DRAW_RANDOM: _bindgen_ty_34 = 5;
pub type _bindgen_ty_34 = u32;
pub const L_RED_WEIGHT: l_float32 = 0.30000001192092896;
pub const L_GREEN_WEIGHT: l_float32 = 0.5;
pub const L_BLUE_WEIGHT: l_float32 = 0.20000000298023224;
pub const REMOVE_CMAP_TO_BINARY: _bindgen_ty_35 = 0;
pub const REMOVE_CMAP_TO_GRAYSCALE: _bindgen_ty_35 = 1;
pub const REMOVE_CMAP_TO_FULL_COLOR: _bindgen_ty_35 = 2;
pub const REMOVE_CMAP_WITH_ALPHA: _bindgen_ty_35 = 3;
pub const REMOVE_CMAP_BASED_ON_SRC: _bindgen_ty_35 = 4;
pub type _bindgen_ty_35 = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Pixa {
    pub n: l_int32,
    pub nalloc: l_int32,
    pub refcount: l_uint32,
    pub pix: *mut *mut Pix,
    pub boxa: *mut Boxa,
}
#[test]
fn bindgen_test_layout_Pixa() {
    assert_eq!(
        ::std::mem::size_of::<Pixa>(),
        32usize,
        concat!("Size of: ", stringify!(Pixa))
    );
    assert_eq!(
        ::std::mem::align_of::<Pixa>(),
        8usize,
        concat!("Alignment of ", stringify!(Pixa))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Pixa>())).n as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(Pixa), "::", stringify!(n))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Pixa>())).nalloc as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Pixa),
            "::",
            stringify!(nalloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Pixa>())).refcount as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Pixa),
            "::",
            stringify!(refcount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Pixa>())).pix as *const _ as usize },
        16usize,
        concat!("Offset of field: ", stringify!(Pixa), "::", stringify!(pix))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Pixa>())).boxa as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Pixa),
            "::",
            stringify!(boxa)
        )
    );
}
pub type PIXA = Pixa;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Pixaa {
    pub n: l_int32,
    pub nalloc: l_int32,
    pub pixa: *mut *mut Pixa,
    pub boxa: *mut Boxa,
}
#[test]
fn bindgen_test_layout_Pixaa() {
    assert_eq!(
        ::std::mem::size_of::<Pixaa>(),
        24usize,
        concat!("Size of: ", stringify!(Pixaa))
    );
    assert_eq!(
        ::std::mem::align_of::<Pixaa>(),
        8usize,
        concat!("Alignment of ", stringify!(Pixaa))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Pixaa>())).n as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(Pixaa), "::", stringify!(n))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Pixaa>())).nalloc as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Pixaa),
            "::",
            stringify!(nalloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Pixaa>())).pixa as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Pixaa),
            "::",
            stringify!(pixa)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Pixaa>())).boxa as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Pixaa),
            "::",
            stringify!(boxa)
        )
    );
}
pub type PIXAA = Pixaa;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Box {
    pub x: l_int32,
    pub y: l_int32,
    pub w: l_int32,
    pub h: l_int32,
    pub refcount: l_uint32,
}
#[test]
fn bindgen_test_layout_Box() {
    assert_eq!(
        ::std::mem::size_of::<Box>(),
        20usize,
        concat!("Size of: ", stringify!(Box))
    );
    assert_eq!(
        ::std::mem::align_of::<Box>(),
        4usize,
        concat!("Alignment of ", stringify!(Box))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Box>())).x as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(Box), "::", stringify!(x))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Box>())).y as *const _ as usize },
        4usize,
        concat!("Offset of field: ", stringify!(Box), "::", stringify!(y))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Box>())).w as *const _ as usize },
        8usize,
        concat!("Offset of field: ", stringify!(Box), "::", stringify!(w))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Box>())).h as *const _ as usize },
        12usize,
        concat!("Offset of field: ", stringify!(Box), "::", stringify!(h))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Box>())).refcount as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Box),
            "::",
            stringify!(refcount)
        )
    );
}
pub type BOX = Box;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Boxa {
    pub n: l_int32,
    pub nalloc: l_int32,
    pub refcount: l_uint32,
    pub box_: *mut *mut Box,
}
#[test]
fn bindgen_test_layout_Boxa() {
    assert_eq!(
        ::std::mem::size_of::<Boxa>(),
        24usize,
        concat!("Size of: ", stringify!(Boxa))
    );
    assert_eq!(
        ::std::mem::align_of::<Boxa>(),
        8usize,
        concat!("Alignment of ", stringify!(Boxa))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Boxa>())).n as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(Boxa), "::", stringify!(n))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Boxa>())).nalloc as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Boxa),
            "::",
            stringify!(nalloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Boxa>())).refcount as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Boxa),
            "::",
            stringify!(refcount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Boxa>())).box_ as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Boxa),
            "::",
            stringify!(box_)
        )
    );
}
pub type BOXA = Boxa;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Boxaa {
    pub n: l_int32,
    pub nalloc: l_int32,
    pub boxa: *mut *mut Boxa,
}
#[test]
fn bindgen_test_layout_Boxaa() {
    assert_eq!(
        ::std::mem::size_of::<Boxaa>(),
        16usize,
        concat!("Size of: ", stringify!(Boxaa))
    );
    assert_eq!(
        ::std::mem::align_of::<Boxaa>(),
        8usize,
        concat!("Alignment of ", stringify!(Boxaa))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Boxaa>())).n as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(Boxaa), "::", stringify!(n))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Boxaa>())).nalloc as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Boxaa),
            "::",
            stringify!(nalloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Boxaa>())).boxa as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Boxaa),
            "::",
            stringify!(boxa)
        )
    );
}
pub type BOXAA = Boxaa;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Pta {
    pub n: l_int32,
    pub nalloc: l_int32,
    pub refcount: l_uint32,
    pub x: *mut l_float32,
    pub y: *mut l_float32,
}
#[test]
fn bindgen_test_layout_Pta() {
    assert_eq!(
        ::std::mem::size_of::<Pta>(),
        32usize,
        concat!("Size of: ", stringify!(Pta))
    );
    assert_eq!(
        ::std::mem::align_of::<Pta>(),
        8usize,
        concat!("Alignment of ", stringify!(Pta))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Pta>())).n as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(Pta), "::", stringify!(n))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Pta>())).nalloc as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Pta),
            "::",
            stringify!(nalloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Pta>())).refcount as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Pta),
            "::",
            stringify!(refcount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Pta>())).x as *const _ as usize },
        16usize,
        concat!("Offset of field: ", stringify!(Pta), "::", stringify!(x))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Pta>())).y as *const _ as usize },
        24usize,
        concat!("Offset of field: ", stringify!(Pta), "::", stringify!(y))
    );
}
pub type PTA = Pta;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Ptaa {
    pub n: l_int32,
    pub nalloc: l_int32,
    pub pta: *mut *mut Pta,
}
#[test]
fn bindgen_test_layout_Ptaa() {
    assert_eq!(
        ::std::mem::size_of::<Ptaa>(),
        16usize,
        concat!("Size of: ", stringify!(Ptaa))
    );
    assert_eq!(
        ::std::mem::align_of::<Ptaa>(),
        8usize,
        concat!("Alignment of ", stringify!(Ptaa))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Ptaa>())).n as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(Ptaa), "::", stringify!(n))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Ptaa>())).nalloc as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Ptaa),
            "::",
            stringify!(nalloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Ptaa>())).pta as *const _ as usize },
        8usize,
        concat!("Offset of field: ", stringify!(Ptaa), "::", stringify!(pta))
    );
}
pub type PTAA = Ptaa;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Pixacc {
    pub w: l_int32,
    pub h: l_int32,
    pub offset: l_int32,
    pub pix: *mut Pix,
}
#[test]
fn bindgen_test_layout_Pixacc() {
    assert_eq!(
        ::std::mem::size_of::<Pixacc>(),
        24usize,
        concat!("Size of: ", stringify!(Pixacc))
    );
    assert_eq!(
        ::std::mem::align_of::<Pixacc>(),
        8usize,
        concat!("Alignment of ", stringify!(Pixacc))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Pixacc>())).w as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(Pixacc), "::", stringify!(w))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Pixacc>())).h as *const _ as usize },
        4usize,
        concat!("Offset of field: ", stringify!(Pixacc), "::", stringify!(h))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Pixacc>())).offset as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Pixacc),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Pixacc>())).pix as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Pixacc),
            "::",
            stringify!(pix)
        )
    );
}
pub type PIXACC = Pixacc;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PixTiling {
    pub pix: *mut Pix,
    pub nx: l_int32,
    pub ny: l_int32,
    pub w: l_int32,
    pub h: l_int32,
    pub xoverlap: l_int32,
    pub yoverlap: l_int32,
    pub strip: l_int32,
}
#[test]
fn bindgen_test_layout_PixTiling() {
    assert_eq!(
        ::std::mem::size_of::<PixTiling>(),
        40usize,
        concat!("Size of: ", stringify!(PixTiling))
    );
    assert_eq!(
        ::std::mem::align_of::<PixTiling>(),
        8usize,
        concat!("Alignment of ", stringify!(PixTiling))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PixTiling>())).pix as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PixTiling),
            "::",
            stringify!(pix)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PixTiling>())).nx as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(PixTiling),
            "::",
            stringify!(nx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PixTiling>())).ny as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(PixTiling),
            "::",
            stringify!(ny)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PixTiling>())).w as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PixTiling),
            "::",
            stringify!(w)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PixTiling>())).h as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(PixTiling),
            "::",
            stringify!(h)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PixTiling>())).xoverlap as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(PixTiling),
            "::",
            stringify!(xoverlap)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PixTiling>())).yoverlap as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(PixTiling),
            "::",
            stringify!(yoverlap)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PixTiling>())).strip as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(PixTiling),
            "::",
            stringify!(strip)
        )
    );
}
pub type PIXTILING = PixTiling;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FPix {
    pub w: l_int32,
    pub h: l_int32,
    pub wpl: l_int32,
    pub refcount: l_uint32,
    pub xres: l_int32,
    pub yres: l_int32,
    pub data: *mut l_float32,
}
#[test]
fn bindgen_test_layout_FPix() {
    assert_eq!(
        ::std::mem::size_of::<FPix>(),
        32usize,
        concat!("Size of: ", stringify!(FPix))
    );
    assert_eq!(
        ::std::mem::align_of::<FPix>(),
        8usize,
        concat!("Alignment of ", stringify!(FPix))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FPix>())).w as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(FPix), "::", stringify!(w))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FPix>())).h as *const _ as usize },
        4usize,
        concat!("Offset of field: ", stringify!(FPix), "::", stringify!(h))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FPix>())).wpl as *const _ as usize },
        8usize,
        concat!("Offset of field: ", stringify!(FPix), "::", stringify!(wpl))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FPix>())).refcount as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(FPix),
            "::",
            stringify!(refcount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FPix>())).xres as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FPix),
            "::",
            stringify!(xres)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FPix>())).yres as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(FPix),
            "::",
            stringify!(yres)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FPix>())).data as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(FPix),
            "::",
            stringify!(data)
        )
    );
}
pub type FPIX = FPix;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FPixa {
    pub n: l_int32,
    pub nalloc: l_int32,
    pub refcount: l_uint32,
    pub fpix: *mut *mut FPix,
}
#[test]
fn bindgen_test_layout_FPixa() {
    assert_eq!(
        ::std::mem::size_of::<FPixa>(),
        24usize,
        concat!("Size of: ", stringify!(FPixa))
    );
    assert_eq!(
        ::std::mem::align_of::<FPixa>(),
        8usize,
        concat!("Alignment of ", stringify!(FPixa))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FPixa>())).n as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(FPixa), "::", stringify!(n))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FPixa>())).nalloc as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(FPixa),
            "::",
            stringify!(nalloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FPixa>())).refcount as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FPixa),
            "::",
            stringify!(refcount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FPixa>())).fpix as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FPixa),
            "::",
            stringify!(fpix)
        )
    );
}
pub type FPIXA = FPixa;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DPix {
    pub w: l_int32,
    pub h: l_int32,
    pub wpl: l_int32,
    pub refcount: l_uint32,
    pub xres: l_int32,
    pub yres: l_int32,
    pub data: *mut l_float64,
}
#[test]
fn bindgen_test_layout_DPix() {
    assert_eq!(
        ::std::mem::size_of::<DPix>(),
        32usize,
        concat!("Size of: ", stringify!(DPix))
    );
    assert_eq!(
        ::std::mem::align_of::<DPix>(),
        8usize,
        concat!("Alignment of ", stringify!(DPix))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DPix>())).w as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(DPix), "::", stringify!(w))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DPix>())).h as *const _ as usize },
        4usize,
        concat!("Offset of field: ", stringify!(DPix), "::", stringify!(h))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DPix>())).wpl as *const _ as usize },
        8usize,
        concat!("Offset of field: ", stringify!(DPix), "::", stringify!(wpl))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DPix>())).refcount as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(DPix),
            "::",
            stringify!(refcount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DPix>())).xres as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(DPix),
            "::",
            stringify!(xres)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DPix>())).yres as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(DPix),
            "::",
            stringify!(yres)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DPix>())).data as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(DPix),
            "::",
            stringify!(data)
        )
    );
}
pub type DPIX = DPix;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PixComp {
    pub w: l_int32,
    pub h: l_int32,
    pub d: l_int32,
    pub xres: l_int32,
    pub yres: l_int32,
    pub comptype: l_int32,
    pub text: *mut ::std::os::raw::c_char,
    pub cmapflag: l_int32,
    pub data: *mut l_uint8,
    pub size: usize,
}
#[test]
fn bindgen_test_layout_PixComp() {
    assert_eq!(
        ::std::mem::size_of::<PixComp>(),
        56usize,
        concat!("Size of: ", stringify!(PixComp))
    );
    assert_eq!(
        ::std::mem::align_of::<PixComp>(),
        8usize,
        concat!("Alignment of ", stringify!(PixComp))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PixComp>())).w as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PixComp),
            "::",
            stringify!(w)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PixComp>())).h as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(PixComp),
            "::",
            stringify!(h)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PixComp>())).d as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(PixComp),
            "::",
            stringify!(d)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PixComp>())).xres as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(PixComp),
            "::",
            stringify!(xres)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PixComp>())).yres as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PixComp),
            "::",
            stringify!(yres)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PixComp>())).comptype as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(PixComp),
            "::",
            stringify!(comptype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PixComp>())).text as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(PixComp),
            "::",
            stringify!(text)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PixComp>())).cmapflag as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(PixComp),
            "::",
            stringify!(cmapflag)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PixComp>())).data as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(PixComp),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PixComp>())).size as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(PixComp),
            "::",
            stringify!(size)
        )
    );
}
pub type PIXC = PixComp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PixaComp {
    pub n: l_int32,
    pub nalloc: l_int32,
    pub offset: l_int32,
    pub pixc: *mut *mut PixComp,
    pub boxa: *mut Boxa,
}
#[test]
fn bindgen_test_layout_PixaComp() {
    assert_eq!(
        ::std::mem::size_of::<PixaComp>(),
        32usize,
        concat!("Size of: ", stringify!(PixaComp))
    );
    assert_eq!(
        ::std::mem::align_of::<PixaComp>(),
        8usize,
        concat!("Alignment of ", stringify!(PixaComp))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PixaComp>())).n as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PixaComp),
            "::",
            stringify!(n)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PixaComp>())).nalloc as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(PixaComp),
            "::",
            stringify!(nalloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PixaComp>())).offset as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(PixaComp),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PixaComp>())).pixc as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PixaComp),
            "::",
            stringify!(pixc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PixaComp>())).boxa as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(PixaComp),
            "::",
            stringify!(boxa)
        )
    );
}
pub type PIXAC = PixaComp;
pub const L_NOCOPY: _bindgen_ty_36 = 0;
pub const L_COPY: _bindgen_ty_36 = 1;
pub const L_CLONE: _bindgen_ty_36 = 2;
pub const L_COPY_CLONE: _bindgen_ty_36 = 3;
pub type _bindgen_ty_36 = u32;
pub const L_INSERT: l_int32 = 0;
pub const L_SHELL_SORT: _bindgen_ty_37 = 1;
pub const L_BIN_SORT: _bindgen_ty_37 = 2;
pub type _bindgen_ty_37 = u32;
pub const L_SORT_INCREASING: _bindgen_ty_38 = 1;
pub const L_SORT_DECREASING: _bindgen_ty_38 = 2;
pub type _bindgen_ty_38 = u32;
pub const L_SORT_BY_X: _bindgen_ty_39 = 1;
pub const L_SORT_BY_Y: _bindgen_ty_39 = 2;
pub const L_SORT_BY_RIGHT: _bindgen_ty_39 = 3;
pub const L_SORT_BY_BOT: _bindgen_ty_39 = 4;
pub const L_SORT_BY_WIDTH: _bindgen_ty_39 = 5;
pub const L_SORT_BY_HEIGHT: _bindgen_ty_39 = 6;
pub const L_SORT_BY_MIN_DIMENSION: _bindgen_ty_39 = 7;
pub const L_SORT_BY_MAX_DIMENSION: _bindgen_ty_39 = 8;
pub const L_SORT_BY_PERIMETER: _bindgen_ty_39 = 9;
pub const L_SORT_BY_AREA: _bindgen_ty_39 = 10;
pub const L_SORT_BY_ASPECT_RATIO: _bindgen_ty_39 = 11;
pub type _bindgen_ty_39 = u32;
pub const L_BLEND_WITH_INVERSE: _bindgen_ty_40 = 1;
pub const L_BLEND_TO_WHITE: _bindgen_ty_40 = 2;
pub const L_BLEND_TO_BLACK: _bindgen_ty_40 = 3;
pub const L_BLEND_GRAY: _bindgen_ty_40 = 4;
pub const L_BLEND_GRAY_WITH_INVERSE: _bindgen_ty_40 = 5;
pub type _bindgen_ty_40 = u32;
pub const L_PAINT_LIGHT: _bindgen_ty_41 = 1;
pub const L_PAINT_DARK: _bindgen_ty_41 = 2;
pub type _bindgen_ty_41 = u32;
pub const L_SET_PIXELS: _bindgen_ty_42 = 1;
pub const L_CLEAR_PIXELS: _bindgen_ty_42 = 2;
pub const L_FLIP_PIXELS: _bindgen_ty_42 = 3;
pub type _bindgen_ty_42 = u32;
pub const L_SELECT_WIDTH: _bindgen_ty_43 = 1;
pub const L_SELECT_HEIGHT: _bindgen_ty_43 = 2;
pub const L_SELECT_XVAL: _bindgen_ty_43 = 3;
pub const L_SELECT_YVAL: _bindgen_ty_43 = 4;
pub const L_SELECT_IF_EITHER: _bindgen_ty_43 = 5;
pub const L_SELECT_IF_BOTH: _bindgen_ty_43 = 6;
pub type _bindgen_ty_43 = u32;
pub const L_SELECT_IF_LT: _bindgen_ty_44 = 1;
pub const L_SELECT_IF_GT: _bindgen_ty_44 = 2;
pub const L_SELECT_IF_LTE: _bindgen_ty_44 = 3;
pub const L_SELECT_IF_GTE: _bindgen_ty_44 = 4;
pub type _bindgen_ty_44 = u32;
pub const L_SELECT_RED: _bindgen_ty_45 = 1;
pub const L_SELECT_GREEN: _bindgen_ty_45 = 2;
pub const L_SELECT_BLUE: _bindgen_ty_45 = 3;
pub const L_SELECT_MIN: _bindgen_ty_45 = 4;
pub const L_SELECT_MAX: _bindgen_ty_45 = 5;
pub const L_SELECT_AVERAGE: _bindgen_ty_45 = 6;
pub const L_SELECT_HUE: _bindgen_ty_45 = 7;
pub const L_SELECT_SATURATION: _bindgen_ty_45 = 8;
pub type _bindgen_ty_45 = u32;
pub const L_LS_BYTE: _bindgen_ty_46 = 1;
pub const L_MS_BYTE: _bindgen_ty_46 = 2;
pub const L_AUTO_BYTE: _bindgen_ty_46 = 3;
pub const L_CLIP_TO_FF: _bindgen_ty_46 = 4;
pub const L_LS_TWO_BYTES: _bindgen_ty_46 = 5;
pub const L_MS_TWO_BYTES: _bindgen_ty_46 = 6;
pub const L_CLIP_TO_FFFF: _bindgen_ty_46 = 7;
pub type _bindgen_ty_46 = u32;
pub const L_ROTATE_AREA_MAP: _bindgen_ty_47 = 1;
pub const L_ROTATE_SHEAR: _bindgen_ty_47 = 2;
pub const L_ROTATE_SAMPLING: _bindgen_ty_47 = 3;
pub type _bindgen_ty_47 = u32;
pub const L_BRING_IN_WHITE: _bindgen_ty_48 = 1;
pub const L_BRING_IN_BLACK: _bindgen_ty_48 = 2;
pub type _bindgen_ty_48 = u32;
pub const L_SHEAR_ABOUT_CORNER: _bindgen_ty_49 = 1;
pub const L_SHEAR_ABOUT_CENTER: _bindgen_ty_49 = 2;
pub type _bindgen_ty_49 = u32;
pub const L_TR_SC_RO: _bindgen_ty_50 = 1;
pub const L_SC_RO_TR: _bindgen_ty_50 = 2;
pub const L_RO_TR_SC: _bindgen_ty_50 = 3;
pub const L_TR_RO_SC: _bindgen_ty_50 = 4;
pub const L_RO_SC_TR: _bindgen_ty_50 = 5;
pub const L_SC_TR_RO: _bindgen_ty_50 = 6;
pub type _bindgen_ty_50 = u32;
pub const L_FILL_WHITE: _bindgen_ty_51 = 1;
pub const L_FILL_BLACK: _bindgen_ty_51 = 2;
pub type _bindgen_ty_51 = u32;
pub const L_SET_WHITE: _bindgen_ty_52 = 1;
pub const L_SET_BLACK: _bindgen_ty_52 = 2;
pub type _bindgen_ty_52 = u32;
pub const L_GET_WHITE_VAL: _bindgen_ty_53 = 1;
pub const L_GET_BLACK_VAL: _bindgen_ty_53 = 2;
pub type _bindgen_ty_53 = u32;
pub const L_WHITE_IS_MAX: _bindgen_ty_54 = 1;
pub const L_BLACK_IS_MAX: _bindgen_ty_54 = 2;
pub type _bindgen_ty_54 = u32;
pub const L_MANHATTAN_DISTANCE: _bindgen_ty_56 = 1;
pub const L_EUCLIDEAN_DISTANCE: _bindgen_ty_56 = 2;
pub type _bindgen_ty_56 = u32;
pub const L_NEGATIVE: _bindgen_ty_57 = 1;
pub const L_NON_NEGATIVE: _bindgen_ty_57 = 2;
pub const L_POSITIVE: _bindgen_ty_57 = 3;
pub const L_NON_POSITIVE: _bindgen_ty_57 = 4;
pub const L_ZERO: _bindgen_ty_57 = 5;
pub const L_ALL: _bindgen_ty_57 = 6;
pub type _bindgen_ty_57 = u32;
pub const L_MEAN_ABSVAL: _bindgen_ty_58 = 1;
pub const L_MEDIAN_VAL: _bindgen_ty_58 = 2;
pub const L_MODE_VAL: _bindgen_ty_58 = 3;
pub const L_MODE_COUNT: _bindgen_ty_58 = 4;
pub const L_ROOT_MEAN_SQUARE: _bindgen_ty_58 = 5;
pub const L_STANDARD_DEVIATION: _bindgen_ty_58 = 6;
pub const L_VARIANCE: _bindgen_ty_58 = 7;
pub type _bindgen_ty_58 = u32;
pub const L_CHOOSE_CONSECUTIVE: _bindgen_ty_59 = 1;
pub const L_CHOOSE_SKIP_BY: _bindgen_ty_59 = 2;
pub type _bindgen_ty_59 = u32;
pub const L_TEXT_ORIENT_UNKNOWN: _bindgen_ty_60 = 0;
pub const L_TEXT_ORIENT_UP: _bindgen_ty_60 = 1;
pub const L_TEXT_ORIENT_LEFT: _bindgen_ty_60 = 2;
pub const L_TEXT_ORIENT_DOWN: _bindgen_ty_60 = 3;
pub const L_TEXT_ORIENT_RIGHT: _bindgen_ty_60 = 4;
pub type _bindgen_ty_60 = u32;
pub const L_HORIZONTAL_EDGES: _bindgen_ty_61 = 0;
pub const L_VERTICAL_EDGES: _bindgen_ty_61 = 1;
pub const L_ALL_EDGES: _bindgen_ty_61 = 2;
pub type _bindgen_ty_61 = u32;
pub const L_HORIZONTAL_LINE: _bindgen_ty_62 = 0;
pub const L_POS_SLOPE_LINE: _bindgen_ty_62 = 1;
pub const L_VERTICAL_LINE: _bindgen_ty_62 = 2;
pub const L_NEG_SLOPE_LINE: _bindgen_ty_62 = 3;
pub const L_OBLIQUE_LINE: _bindgen_ty_62 = 4;
pub type _bindgen_ty_62 = u32;
pub const L_PORTRAIT_MODE: _bindgen_ty_63 = 0;
pub const L_LANDSCAPE_MODE: _bindgen_ty_63 = 1;
pub type _bindgen_ty_63 = u32;
pub const L_FROM_LEFT: _bindgen_ty_64 = 0;
pub const L_FROM_RIGHT: _bindgen_ty_64 = 1;
pub const L_FROM_TOP: _bindgen_ty_64 = 2;
pub const L_FROM_BOT: _bindgen_ty_64 = 3;
pub const L_SCAN_NEGATIVE: _bindgen_ty_64 = 4;
pub const L_SCAN_POSITIVE: _bindgen_ty_64 = 5;
pub const L_SCAN_BOTH: _bindgen_ty_64 = 6;
pub const L_SCAN_HORIZONTAL: _bindgen_ty_64 = 7;
pub const L_SCAN_VERTICAL: _bindgen_ty_64 = 8;
pub type _bindgen_ty_64 = u32;
pub const L_ADJUST_SKIP: _bindgen_ty_65 = 0;
pub const L_ADJUST_LEFT: _bindgen_ty_65 = 1;
pub const L_ADJUST_RIGHT: _bindgen_ty_65 = 2;
pub const L_ADJUST_LEFT_AND_RIGHT: _bindgen_ty_65 = 3;
pub const L_ADJUST_TOP: _bindgen_ty_65 = 4;
pub const L_ADJUST_BOT: _bindgen_ty_65 = 5;
pub const L_ADJUST_TOP_AND_BOT: _bindgen_ty_65 = 6;
pub const L_ADJUST_CHOOSE_MIN: _bindgen_ty_65 = 7;
pub const L_ADJUST_CHOOSE_MAX: _bindgen_ty_65 = 8;
pub const L_SET_LEFT: _bindgen_ty_65 = 9;
pub const L_SET_RIGHT: _bindgen_ty_65 = 10;
pub const L_SET_TOP: _bindgen_ty_65 = 11;
pub const L_SET_BOT: _bindgen_ty_65 = 12;
pub const L_GET_LEFT: _bindgen_ty_65 = 13;
pub const L_GET_RIGHT: _bindgen_ty_65 = 14;
pub const L_GET_TOP: _bindgen_ty_65 = 15;
pub const L_GET_BOT: _bindgen_ty_65 = 16;
pub type _bindgen_ty_65 = u32;
pub const L_USE_MINSIZE: _bindgen_ty_66 = 1;
pub const L_USE_MAXSIZE: _bindgen_ty_66 = 2;
pub const L_SUB_ON_LOC_DIFF: _bindgen_ty_66 = 3;
pub const L_SUB_ON_SIZE_DIFF: _bindgen_ty_66 = 4;
pub const L_USE_CAPPED_MIN: _bindgen_ty_66 = 5;
pub const L_USE_CAPPED_MAX: _bindgen_ty_66 = 6;
pub type _bindgen_ty_66 = u32;
pub const L_COMBINE: _bindgen_ty_67 = 1;
pub const L_REMOVE_SMALL: _bindgen_ty_67 = 2;
pub type _bindgen_ty_67 = u32;
pub const L_USE_ALL_BOXES: _bindgen_ty_68 = 1;
pub const L_USE_SAME_PARITY_BOXES: _bindgen_ty_68 = 2;
pub type _bindgen_ty_68 = u32;
pub const L_WARP_TO_LEFT: _bindgen_ty_69 = 1;
pub const L_WARP_TO_RIGHT: _bindgen_ty_69 = 2;
pub type _bindgen_ty_69 = u32;
pub const L_LINEAR_WARP: _bindgen_ty_70 = 1;
pub const L_QUADRATIC_WARP: _bindgen_ty_70 = 2;
pub type _bindgen_ty_70 = u32;
pub const L_INTERPOLATED: _bindgen_ty_71 = 1;
pub const L_SAMPLED: _bindgen_ty_71 = 2;
pub type _bindgen_ty_71 = u32;
pub const L_THIN_FG: _bindgen_ty_72 = 1;
pub const L_THIN_BG: _bindgen_ty_72 = 2;
pub type _bindgen_ty_72 = u32;
pub const L_HORIZONTAL_RUNS: _bindgen_ty_73 = 0;
pub const L_VERTICAL_RUNS: _bindgen_ty_73 = 1;
pub type _bindgen_ty_73 = u32;
pub const L_SOBEL_EDGE: _bindgen_ty_74 = 1;
pub const L_TWO_SIDED_EDGE: _bindgen_ty_74 = 2;
pub type _bindgen_ty_74 = u32;
pub const L_SUBPIXEL_ORDER_RGB: _bindgen_ty_75 = 1;
pub const L_SUBPIXEL_ORDER_BGR: _bindgen_ty_75 = 2;
pub const L_SUBPIXEL_ORDER_VRGB: _bindgen_ty_75 = 3;
pub const L_SUBPIXEL_ORDER_VBGR: _bindgen_ty_75 = 4;
pub type _bindgen_ty_75 = u32;
pub const L_HS_HISTO: _bindgen_ty_76 = 1;
pub const L_HV_HISTO: _bindgen_ty_76 = 2;
pub const L_SV_HISTO: _bindgen_ty_76 = 3;
pub type _bindgen_ty_76 = u32;
pub const L_INCLUDE_REGION: _bindgen_ty_77 = 1;
pub const L_EXCLUDE_REGION: _bindgen_ty_77 = 2;
pub type _bindgen_ty_77 = u32;
pub const L_ADD_ABOVE: _bindgen_ty_78 = 1;
pub const L_ADD_BELOW: _bindgen_ty_78 = 2;
pub const L_ADD_LEFT: _bindgen_ty_78 = 3;
pub const L_ADD_RIGHT: _bindgen_ty_78 = 4;
pub const L_ADD_AT_TOP: _bindgen_ty_78 = 5;
pub const L_ADD_AT_BOT: _bindgen_ty_78 = 6;
pub const L_ADD_AT_LEFT: _bindgen_ty_78 = 7;
pub const L_ADD_AT_RIGHT: _bindgen_ty_78 = 8;
pub type _bindgen_ty_78 = u32;
pub const L_PLOT_AT_TOP: _bindgen_ty_79 = 1;
pub const L_PLOT_AT_MID_HORIZ: _bindgen_ty_79 = 2;
pub const L_PLOT_AT_BOT: _bindgen_ty_79 = 3;
pub const L_PLOT_AT_LEFT: _bindgen_ty_79 = 4;
pub const L_PLOT_AT_MID_VERT: _bindgen_ty_79 = 5;
pub const L_PLOT_AT_RIGHT: _bindgen_ty_79 = 6;
pub type _bindgen_ty_79 = u32;
pub const L_DISPLAY_WITH_XZGV: _bindgen_ty_80 = 1;
pub const L_DISPLAY_WITH_XLI: _bindgen_ty_80 = 2;
pub const L_DISPLAY_WITH_XV: _bindgen_ty_80 = 3;
pub const L_DISPLAY_WITH_IV: _bindgen_ty_80 = 4;
pub const L_DISPLAY_WITH_OPEN: _bindgen_ty_80 = 5;
pub type _bindgen_ty_80 = u32;
pub const L_NO_CHROMA_SAMPLING_JPEG: _bindgen_ty_81 = 1;
pub type _bindgen_ty_81 = u32;
pub const L_CLIP_TO_ZERO: _bindgen_ty_82 = 1;
pub const L_TAKE_ABSVAL: _bindgen_ty_82 = 2;
pub type _bindgen_ty_82 = u32;
pub const L_LESS_THAN_ZERO: _bindgen_ty_83 = 1;
pub const L_EQUAL_TO_ZERO: _bindgen_ty_83 = 2;
pub const L_GREATER_THAN_ZERO: _bindgen_ty_83 = 3;
pub type _bindgen_ty_83 = u32;
pub const L_ADD_TRAIL_SLASH: _bindgen_ty_84 = 1;
pub const L_REMOVE_TRAIL_SLASH: _bindgen_ty_84 = 2;
pub type _bindgen_ty_84 = u32;
pub type alloc_fn =
    ::std::option::Option<unsafe extern "C" fn(arg1: usize) -> *mut ::std::os::raw::c_void>;
pub type dealloc_fn =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_Recog {
    pub scalew: l_int32,
    pub scaleh: l_int32,
    pub linew: l_int32,
    pub templ_use: l_int32,
    pub maxarraysize: l_int32,
    pub setsize: l_int32,
    pub threshold: l_int32,
    pub maxyshift: l_int32,
    pub charset_type: l_int32,
    pub charset_size: l_int32,
    pub min_nopad: l_int32,
    pub num_samples: l_int32,
    pub minwidth_u: l_int32,
    pub maxwidth_u: l_int32,
    pub minheight_u: l_int32,
    pub maxheight_u: l_int32,
    pub minwidth: l_int32,
    pub maxwidth: l_int32,
    pub ave_done: l_int32,
    pub train_done: l_int32,
    pub max_wh_ratio: l_float32,
    pub max_ht_ratio: l_float32,
    pub min_splitw: l_int32,
    pub max_splith: l_int32,
    pub sa_text: *mut Sarray,
    pub dna_tochar: *mut L_Dna,
    pub centtab: *mut l_int32,
    pub sumtab: *mut l_int32,
    pub pixaa_u: *mut Pixaa,
    pub ptaa_u: *mut Ptaa,
    pub naasum_u: *mut Numaa,
    pub pixaa: *mut Pixaa,
    pub ptaa: *mut Ptaa,
    pub naasum: *mut Numaa,
    pub pixa_u: *mut Pixa,
    pub pta_u: *mut Pta,
    pub nasum_u: *mut Numa,
    pub pixa: *mut Pixa,
    pub pta: *mut Pta,
    pub nasum: *mut Numa,
    pub pixa_tr: *mut Pixa,
    pub pixadb_ave: *mut Pixa,
    pub pixa_id: *mut Pixa,
    pub pixdb_ave: *mut Pix,
    pub pixdb_range: *mut Pix,
    pub pixadb_boot: *mut Pixa,
    pub pixadb_split: *mut Pixa,
    pub bmf: *mut L_Bmf,
    pub bmf_size: l_int32,
    pub did: *mut L_Rdid,
    pub rch: *mut L_Rch,
    pub rcha: *mut L_Rcha,
}
#[test]
fn bindgen_test_layout_L_Recog() {
    assert_eq!(
        ::std::mem::size_of::<L_Recog>(),
        320usize,
        concat!("Size of: ", stringify!(L_Recog))
    );
    assert_eq!(
        ::std::mem::align_of::<L_Recog>(),
        8usize,
        concat!("Alignment of ", stringify!(L_Recog))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).scalew as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(scalew)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).scaleh as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(scaleh)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).linew as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(linew)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).templ_use as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(templ_use)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).maxarraysize as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(maxarraysize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).setsize as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(setsize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).threshold as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(threshold)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).maxyshift as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(maxyshift)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).charset_type as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(charset_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).charset_size as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(charset_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).min_nopad as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(min_nopad)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).num_samples as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(num_samples)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).minwidth_u as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(minwidth_u)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).maxwidth_u as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(maxwidth_u)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).minheight_u as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(minheight_u)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).maxheight_u as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(maxheight_u)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).minwidth as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(minwidth)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).maxwidth as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(maxwidth)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).ave_done as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(ave_done)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).train_done as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(train_done)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).max_wh_ratio as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(max_wh_ratio)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).max_ht_ratio as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(max_ht_ratio)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).min_splitw as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(min_splitw)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).max_splith as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(max_splith)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).sa_text as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(sa_text)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).dna_tochar as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(dna_tochar)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).centtab as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(centtab)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).sumtab as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(sumtab)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).pixaa_u as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(pixaa_u)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).ptaa_u as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(ptaa_u)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).naasum_u as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(naasum_u)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).pixaa as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(pixaa)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).ptaa as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(ptaa)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).naasum as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(naasum)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).pixa_u as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(pixa_u)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).pta_u as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(pta_u)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).nasum_u as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(nasum_u)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).pixa as *const _ as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(pixa)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).pta as *const _ as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(pta)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).nasum as *const _ as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(nasum)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).pixa_tr as *const _ as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(pixa_tr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).pixadb_ave as *const _ as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(pixadb_ave)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).pixa_id as *const _ as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(pixa_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).pixdb_ave as *const _ as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(pixdb_ave)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).pixdb_range as *const _ as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(pixdb_range)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).pixadb_boot as *const _ as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(pixadb_boot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).pixadb_split as *const _ as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(pixadb_split)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).bmf as *const _ as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(bmf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).bmf_size as *const _ as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(bmf_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).did as *const _ as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(did)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).rch as *const _ as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(rch)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Recog>())).rcha as *const _ as usize },
        312usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Recog),
            "::",
            stringify!(rcha)
        )
    );
}
pub type L_RECOG = L_Recog;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_Rch {
    pub index: l_int32,
    pub score: l_float32,
    pub text: *mut ::std::os::raw::c_char,
    pub sample: l_int32,
    pub xloc: l_int32,
    pub yloc: l_int32,
    pub width: l_int32,
}
#[test]
fn bindgen_test_layout_L_Rch() {
    assert_eq!(
        ::std::mem::size_of::<L_Rch>(),
        32usize,
        concat!("Size of: ", stringify!(L_Rch))
    );
    assert_eq!(
        ::std::mem::align_of::<L_Rch>(),
        8usize,
        concat!("Alignment of ", stringify!(L_Rch))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Rch>())).index as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Rch),
            "::",
            stringify!(index)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Rch>())).score as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Rch),
            "::",
            stringify!(score)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Rch>())).text as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Rch),
            "::",
            stringify!(text)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Rch>())).sample as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Rch),
            "::",
            stringify!(sample)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Rch>())).xloc as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Rch),
            "::",
            stringify!(xloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Rch>())).yloc as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Rch),
            "::",
            stringify!(yloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Rch>())).width as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Rch),
            "::",
            stringify!(width)
        )
    );
}
pub type L_RCH = L_Rch;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_Rcha {
    pub naindex: *mut Numa,
    pub nascore: *mut Numa,
    pub satext: *mut Sarray,
    pub nasample: *mut Numa,
    pub naxloc: *mut Numa,
    pub nayloc: *mut Numa,
    pub nawidth: *mut Numa,
}
#[test]
fn bindgen_test_layout_L_Rcha() {
    assert_eq!(
        ::std::mem::size_of::<L_Rcha>(),
        56usize,
        concat!("Size of: ", stringify!(L_Rcha))
    );
    assert_eq!(
        ::std::mem::align_of::<L_Rcha>(),
        8usize,
        concat!("Alignment of ", stringify!(L_Rcha))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Rcha>())).naindex as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Rcha),
            "::",
            stringify!(naindex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Rcha>())).nascore as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Rcha),
            "::",
            stringify!(nascore)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Rcha>())).satext as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Rcha),
            "::",
            stringify!(satext)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Rcha>())).nasample as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Rcha),
            "::",
            stringify!(nasample)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Rcha>())).naxloc as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Rcha),
            "::",
            stringify!(naxloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Rcha>())).nayloc as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Rcha),
            "::",
            stringify!(nayloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Rcha>())).nawidth as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Rcha),
            "::",
            stringify!(nawidth)
        )
    );
}
pub type L_RCHA = L_Rcha;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_Rdid {
    pub pixs: *mut Pix,
    pub counta: *mut *mut l_int32,
    pub delya: *mut *mut l_int32,
    pub narray: l_int32,
    pub size: l_int32,
    pub setwidth: *mut l_int32,
    pub nasum: *mut Numa,
    pub namoment: *mut Numa,
    pub fullarrays: l_int32,
    pub beta: *mut l_float32,
    pub gamma: *mut l_float32,
    pub trellisscore: *mut l_float32,
    pub trellistempl: *mut l_int32,
    pub natempl: *mut Numa,
    pub naxloc: *mut Numa,
    pub nadely: *mut Numa,
    pub nawidth: *mut Numa,
    pub boxa: *mut Boxa,
    pub nascore: *mut Numa,
    pub natempl_r: *mut Numa,
    pub nasample_r: *mut Numa,
    pub naxloc_r: *mut Numa,
    pub nadely_r: *mut Numa,
    pub nawidth_r: *mut Numa,
    pub nascore_r: *mut Numa,
}
#[test]
fn bindgen_test_layout_L_Rdid() {
    assert_eq!(
        ::std::mem::size_of::<L_Rdid>(),
        192usize,
        concat!("Size of: ", stringify!(L_Rdid))
    );
    assert_eq!(
        ::std::mem::align_of::<L_Rdid>(),
        8usize,
        concat!("Alignment of ", stringify!(L_Rdid))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Rdid>())).pixs as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Rdid),
            "::",
            stringify!(pixs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Rdid>())).counta as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Rdid),
            "::",
            stringify!(counta)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Rdid>())).delya as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Rdid),
            "::",
            stringify!(delya)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Rdid>())).narray as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Rdid),
            "::",
            stringify!(narray)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Rdid>())).size as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Rdid),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Rdid>())).setwidth as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Rdid),
            "::",
            stringify!(setwidth)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Rdid>())).nasum as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Rdid),
            "::",
            stringify!(nasum)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Rdid>())).namoment as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Rdid),
            "::",
            stringify!(namoment)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Rdid>())).fullarrays as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Rdid),
            "::",
            stringify!(fullarrays)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Rdid>())).beta as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Rdid),
            "::",
            stringify!(beta)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Rdid>())).gamma as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Rdid),
            "::",
            stringify!(gamma)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Rdid>())).trellisscore as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Rdid),
            "::",
            stringify!(trellisscore)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Rdid>())).trellistempl as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Rdid),
            "::",
            stringify!(trellistempl)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Rdid>())).natempl as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Rdid),
            "::",
            stringify!(natempl)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Rdid>())).naxloc as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Rdid),
            "::",
            stringify!(naxloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Rdid>())).nadely as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Rdid),
            "::",
            stringify!(nadely)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Rdid>())).nawidth as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Rdid),
            "::",
            stringify!(nawidth)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Rdid>())).boxa as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Rdid),
            "::",
            stringify!(boxa)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Rdid>())).nascore as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Rdid),
            "::",
            stringify!(nascore)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Rdid>())).natempl_r as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Rdid),
            "::",
            stringify!(natempl_r)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Rdid>())).nasample_r as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Rdid),
            "::",
            stringify!(nasample_r)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Rdid>())).naxloc_r as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Rdid),
            "::",
            stringify!(naxloc_r)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Rdid>())).nadely_r as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Rdid),
            "::",
            stringify!(nadely_r)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Rdid>())).nawidth_r as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Rdid),
            "::",
            stringify!(nawidth_r)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Rdid>())).nascore_r as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Rdid),
            "::",
            stringify!(nascore_r)
        )
    );
}
pub type L_RDID = L_Rdid;
pub const L_UNKNOWN: _bindgen_ty_85 = 0;
pub const L_ARABIC_NUMERALS: _bindgen_ty_85 = 1;
pub const L_LC_ROMAN_NUMERALS: _bindgen_ty_85 = 2;
pub const L_UC_ROMAN_NUMERALS: _bindgen_ty_85 = 3;
pub const L_LC_ALPHA: _bindgen_ty_85 = 4;
pub const L_UC_ALPHA: _bindgen_ty_85 = 5;
pub type _bindgen_ty_85 = u32;
pub const L_USE_ALL_TEMPLATES: _bindgen_ty_86 = 0;
pub const L_USE_AVERAGE_TEMPLATES: _bindgen_ty_86 = 1;
pub type _bindgen_ty_86 = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_RegParams {
    pub fp: *mut FILE,
    pub testname: *mut ::std::os::raw::c_char,
    pub tempfile: *mut ::std::os::raw::c_char,
    pub mode: l_int32,
    pub index: l_int32,
    pub success: l_int32,
    pub display: l_int32,
    pub tstart: L_TIMER,
}
#[test]
fn bindgen_test_layout_L_RegParams() {
    assert_eq!(
        ::std::mem::size_of::<L_RegParams>(),
        48usize,
        concat!("Size of: ", stringify!(L_RegParams))
    );
    assert_eq!(
        ::std::mem::align_of::<L_RegParams>(),
        8usize,
        concat!("Alignment of ", stringify!(L_RegParams))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_RegParams>())).fp as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(L_RegParams),
            "::",
            stringify!(fp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_RegParams>())).testname as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(L_RegParams),
            "::",
            stringify!(testname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_RegParams>())).tempfile as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(L_RegParams),
            "::",
            stringify!(tempfile)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_RegParams>())).mode as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(L_RegParams),
            "::",
            stringify!(mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_RegParams>())).index as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(L_RegParams),
            "::",
            stringify!(index)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_RegParams>())).success as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(L_RegParams),
            "::",
            stringify!(success)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_RegParams>())).display as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(L_RegParams),
            "::",
            stringify!(display)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_RegParams>())).tstart as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(L_RegParams),
            "::",
            stringify!(tstart)
        )
    );
}
pub type L_REGPARAMS = L_RegParams;
pub const L_REG_GENERATE: _bindgen_ty_87 = 0;
pub const L_REG_COMPARE: _bindgen_ty_87 = 1;
pub const L_REG_DISPLAY: _bindgen_ty_87 = 2;
pub type _bindgen_ty_87 = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_StrCode {
    pub fileno: l_int32,
    pub ifunc: l_int32,
    pub function: *mut SARRAY,
    pub data: *mut SARRAY,
    pub descr: *mut SARRAY,
    pub n: l_int32,
}
#[test]
fn bindgen_test_layout_L_StrCode() {
    assert_eq!(
        ::std::mem::size_of::<L_StrCode>(),
        40usize,
        concat!("Size of: ", stringify!(L_StrCode))
    );
    assert_eq!(
        ::std::mem::align_of::<L_StrCode>(),
        8usize,
        concat!("Alignment of ", stringify!(L_StrCode))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_StrCode>())).fileno as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(L_StrCode),
            "::",
            stringify!(fileno)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_StrCode>())).ifunc as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(L_StrCode),
            "::",
            stringify!(ifunc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_StrCode>())).function as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(L_StrCode),
            "::",
            stringify!(function)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_StrCode>())).data as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(L_StrCode),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_StrCode>())).descr as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(L_StrCode),
            "::",
            stringify!(descr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_StrCode>())).n as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(L_StrCode),
            "::",
            stringify!(n)
        )
    );
}
pub type L_STRCODE = L_StrCode;
pub const L_STR_TYPE: _bindgen_ty_88 = 0;
pub const L_STR_NAME: _bindgen_ty_88 = 1;
pub const L_STR_READER: _bindgen_ty_88 = 2;
pub const L_STR_MEMREADER: _bindgen_ty_88 = 3;
pub type _bindgen_ty_88 = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_Sudoku {
    pub num: l_int32,
    pub locs: *mut l_int32,
    pub current: l_int32,
    pub init: *mut l_int32,
    pub state: *mut l_int32,
    pub nguess: l_int32,
    pub finished: l_int32,
    pub failure: l_int32,
}
#[test]
fn bindgen_test_layout_L_Sudoku() {
    assert_eq!(
        ::std::mem::size_of::<L_Sudoku>(),
        56usize,
        concat!("Size of: ", stringify!(L_Sudoku))
    );
    assert_eq!(
        ::std::mem::align_of::<L_Sudoku>(),
        8usize,
        concat!("Alignment of ", stringify!(L_Sudoku))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Sudoku>())).num as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Sudoku),
            "::",
            stringify!(num)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Sudoku>())).locs as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Sudoku),
            "::",
            stringify!(locs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Sudoku>())).current as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Sudoku),
            "::",
            stringify!(current)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Sudoku>())).init as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Sudoku),
            "::",
            stringify!(init)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Sudoku>())).state as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Sudoku),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Sudoku>())).nguess as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Sudoku),
            "::",
            stringify!(nguess)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Sudoku>())).finished as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Sudoku),
            "::",
            stringify!(finished)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_Sudoku>())).failure as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(L_Sudoku),
            "::",
            stringify!(failure)
        )
    );
}
pub type L_SUDOKU = L_Sudoku;
pub const L_SUDOKU_INIT: _bindgen_ty_89 = 0;
pub const L_SUDOKU_STATE: _bindgen_ty_89 = 1;
pub type _bindgen_ty_89 = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_WShed {
    pub pixs: *mut Pix,
    pub pixm: *mut Pix,
    pub mindepth: l_int32,
    pub pixlab: *mut Pix,
    pub pixt: *mut Pix,
    pub lines8: *mut *mut ::std::os::raw::c_void,
    pub linem1: *mut *mut ::std::os::raw::c_void,
    pub linelab32: *mut *mut ::std::os::raw::c_void,
    pub linet1: *mut *mut ::std::os::raw::c_void,
    pub pixad: *mut Pixa,
    pub ptas: *mut Pta,
    pub nasi: *mut Numa,
    pub nash: *mut Numa,
    pub namh: *mut Numa,
    pub nalevels: *mut Numa,
    pub nseeds: l_int32,
    pub nother: l_int32,
    pub lut: *mut l_int32,
    pub links: *mut *mut Numa,
    pub arraysize: l_int32,
    pub debug: l_int32,
}
#[test]
fn bindgen_test_layout_L_WShed() {
    assert_eq!(
        ::std::mem::size_of::<L_WShed>(),
        152usize,
        concat!("Size of: ", stringify!(L_WShed))
    );
    assert_eq!(
        ::std::mem::align_of::<L_WShed>(),
        8usize,
        concat!("Alignment of ", stringify!(L_WShed))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_WShed>())).pixs as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(L_WShed),
            "::",
            stringify!(pixs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_WShed>())).pixm as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(L_WShed),
            "::",
            stringify!(pixm)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_WShed>())).mindepth as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(L_WShed),
            "::",
            stringify!(mindepth)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_WShed>())).pixlab as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(L_WShed),
            "::",
            stringify!(pixlab)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_WShed>())).pixt as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(L_WShed),
            "::",
            stringify!(pixt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_WShed>())).lines8 as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(L_WShed),
            "::",
            stringify!(lines8)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_WShed>())).linem1 as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(L_WShed),
            "::",
            stringify!(linem1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_WShed>())).linelab32 as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(L_WShed),
            "::",
            stringify!(linelab32)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_WShed>())).linet1 as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(L_WShed),
            "::",
            stringify!(linet1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_WShed>())).pixad as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(L_WShed),
            "::",
            stringify!(pixad)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_WShed>())).ptas as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(L_WShed),
            "::",
            stringify!(ptas)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_WShed>())).nasi as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(L_WShed),
            "::",
            stringify!(nasi)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_WShed>())).nash as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(L_WShed),
            "::",
            stringify!(nash)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_WShed>())).namh as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(L_WShed),
            "::",
            stringify!(namh)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_WShed>())).nalevels as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(L_WShed),
            "::",
            stringify!(nalevels)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_WShed>())).nseeds as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(L_WShed),
            "::",
            stringify!(nseeds)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_WShed>())).nother as *const _ as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(L_WShed),
            "::",
            stringify!(nother)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_WShed>())).lut as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(L_WShed),
            "::",
            stringify!(lut)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_WShed>())).links as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(L_WShed),
            "::",
            stringify!(links)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_WShed>())).arraysize as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(L_WShed),
            "::",
            stringify!(arraysize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<L_WShed>())).debug as *const _ as usize },
        148usize,
        concat!(
            "Offset of field: ",
            stringify!(L_WShed),
            "::",
            stringify!(debug)
        )
    );
}
pub type L_WSHED = L_WShed;
extern "C" {
    pub fn pixCleanBackgroundToWhite(
        pixs: *mut PIX,
        pixim: *mut PIX,
        pixg: *mut PIX,
        gamma: l_float32,
        blackval: l_int32,
        whiteval: l_int32,
    ) -> *mut PIX;
}
extern "C" {
    pub fn pixBackgroundNormSimple(pixs: *mut PIX, pixim: *mut PIX, pixg: *mut PIX) -> *mut PIX;
}
extern "C" {
    pub fn pixBackgroundNorm(
        pixs: *mut PIX,
        pixim: *mut PIX,
        pixg: *mut PIX,
        sx: l_int32,
        sy: l_int32,
        thresh: l_int32,
        mincount: l_int32,
        bgval: l_int32,
        smoothx: l_int32,
        smoothy: l_int32,
    ) -> *mut PIX;
}
extern "C" {
    pub fn pixBackgroundNormMorph(
        pixs: *mut PIX,
        pixim: *mut PIX,
        reduction: l_int32,
        size: l_int32,
        bgval: l_int32,
    ) -> *mut PIX;
}
extern "C" {
    pub fn pixBackgroundNormGrayArray(
        pixs: *mut PIX,
        pixim: *mut PIX,
        sx: l_int32,
        sy: l_int32,
        thresh: l_int32,
        mincount: l_int32,
        bgval: l_int32,
        smoothx: l_int32,
        smoothy: l_int32,
        ppixd: *mut *mut PIX,
    ) -> l_int32;
}
extern "C" {
    pub fn pixBackgroundNormRGBArrays(
        pixs: *mut PIX,
        pixim: *mut PIX,
        pixg: *mut PIX,
        sx: l_int32,
        sy: l_int32,
        thresh: l_int32,
        mincount: l_int32,
        bgval: l_int32,
        smoothx: l_int32,
        smoothy: l_int32,
        ppixr: *mut *mut PIX,
        ppixg: *mut *mut PIX,
        ppixb: *mut *mut PIX,
    ) -> l_int32;
}
extern "C" {
    pub fn pixBackgroundNormGrayArrayMorph(
        pixs: *mut PIX,
        pixim: *mut PIX,
        reduction: l_int32,
        size: l_int32,
        bgval: l_int32,
        ppixd: *mut *mut PIX,
    ) -> l_int32;
}
extern "C" {
    pub fn pixBackgroundNormRGBArraysMorph(
        pixs: *mut PIX,
        pixim: *mut PIX,
        reduction: l_int32,
        size: l_int32,
        bgval: l_int32,
        ppixr: *mut *mut PIX,
        ppixg: *mut *mut PIX,
        ppixb: *mut *mut PIX,
    ) -> l_int32;
}
extern "C" {
    pub fn pixGetBackgroundGrayMap(
        pixs: *mut PIX,
        pixim: *mut PIX,
        sx: l_int32,
        sy: l_int32,
        thresh: l_int32,
        mincount: l_int32,
        ppixd: *mut *mut PIX,
    ) -> l_int32;
}
extern "C" {
    pub fn pixGetBackgroundRGBMap(
        pixs: *mut PIX,
        pixim: *mut PIX,
        pixg: *mut PIX,
        sx: l_int32,
        sy: l_int32,
        thresh: l_int32,
        mincount: l_int32,
        ppixmr: *mut *mut PIX,
        ppixmg: *mut *mut PIX,
        ppixmb: *mut *mut PIX,
    ) -> l_int32;
}
extern "C" {
    pub fn pixGetBackgroundGrayMapMorph(
        pixs: *mut PIX,
        pixim: *mut PIX,
        reduction: l_int32,
        size: l_int32,
        ppixm: *mut *mut PIX,
    ) -> l_int32;
}
extern "C" {
    pub fn pixGetBackgroundRGBMapMorph(
        pixs: *mut PIX,
        pixim: *mut PIX,
        reduction: l_int32,
        size: l_int32,
        ppixmr: *mut *mut PIX,
        ppixmg: *mut *mut PIX,
        ppixmb: *mut *mut PIX,
    ) -> l_int32;
}
extern "C" {
    pub fn pixFillMapHoles(pix: *mut PIX, nx: l_int32, ny: l_int32, filltype: l_int32) -> l_int32;
}
extern "C" {
    pub fn pixExtendByReplication(pixs: *mut PIX, addw: l_int32, addh: l_int32) -> *mut PIX;
}
extern "C" {
    pub fn pixSmoothConnectedRegions(pixs: *mut PIX, pixm: *mut PIX, factor: l_int32) -> l_int32;
}
extern "C" {
    pub fn pixGetInvBackgroundMap(
        pixs: *mut PIX,
        bgval: l_int32,
        smoothx: l_int32,
        smoothy: l_int32,
    ) -> *mut PIX;
}
extern "C" {
    pub fn pixApplyInvBackgroundGrayMap(
        pixs: *mut PIX,
        pixm: *mut PIX,
        sx: l_int32,
        sy: l_int32,
    ) -> *mut PIX;
}
extern "C" {
    pub fn pixApplyInvBackgroundRGBMap(
        pixs: *mut PIX,
        pixmr: *mut PIX,
        pixmg: *mut PIX,
        pixmb: *mut PIX,
        sx: l_int32,
        sy: l_int32,
    ) -> *mut PIX;
}
extern "C" {
    pub fn pixApplyVariableGrayMap(pixs: *mut PIX, pixg: *mut PIX, target: l_int32) -> *mut PIX;
}
extern "C" {
    pub fn pixGlobalNormRGB(
        pixd: *mut PIX,
        pixs: *mut PIX,
        rval: l_int32,
        gval: l_int32,
        bval: l_int32,
        mapval: l_int32,
    ) -> *mut PIX;
}
extern "C" {
    pub fn pixGlobalNormNoSatRGB(
        pixd: *mut PIX,
        pixs: *mut PIX,
        rval: l_int32,
        gval: l_int32,
        bval: l_int32,
        factor: l_int32,
        rank: l_float32,
    ) -> *mut PIX;
}
extern "C" {
    pub fn pixThresholdSpreadNorm(
        pixs: *mut PIX,
        filtertype: l_int32,
        edgethresh: l_int32,
        smoothx: l_int32,
        smoothy: l_int32,
        gamma: l_float32,
        minval: l_int32,
        maxval: l_int32,
        targetthresh: l_int32,
        ppixth: *mut *mut PIX,
        ppixb: *mut *mut PIX,
        ppixd: *mut *mut PIX,
    ) -> l_int32;
}
extern "C" {
    pub fn pixBackgroundNormFlex(
        pixs: *mut PIX,
        sx: l_int32,
        sy: l_int32,
        smoothx: l_int32,
        smoothy: l_int32,
        delta: l_int32,
    ) -> *mut PIX;
}
extern "C" {
    pub fn pixContrastNorm(
        pixd: *mut PIX,
        pixs: *mut PIX,
        sx: l_int32,
        sy: l_int32,
        mindiff: l_int32,
        smoothx: l_int32,
        smoothy: l_int32,
    ) -> *mut PIX;
}
extern "C" {
    pub fn pixMinMaxTiles(
        pixs: *mut PIX,
        sx: l_int32,
        sy: l_int32,
        mindiff: l_int32,
        smoothx: l_int32,
        smoothy: l_int32,
        ppixmin: *mut *mut PIX,
        ppixmax: *mut *mut PIX,
    ) -> l_int32;
}
extern "C" {
    pub fn pixSetLowContrast(pixs1: *mut PIX, pixs2: *mut PIX, mindiff: l_int32) -> l_int32;
}
extern "C" {
    pub fn pixLinearTRCTiled(
        pixd: *mut PIX,
        pixs: *mut PIX,
        sx: l_int32,
        sy: l_int32,
        pixmin: *mut PIX,
        pixmax: *mut PIX,
    ) -> *mut PIX;
}
extern "C" {
    pub fn pixAffineSampledPta(
        pixs: *mut PIX,
        ptad: *mut PTA,
        ptas: *mut PTA,
        incolor: l_int32,
    ) -> *mut PIX;
}
extern "C" {
    pub fn pixAffineSampled(pixs: *mut PIX, vc: *mut l_float32, incolor: l_int32) -> *mut PIX;
}
extern "C" {
    pub fn pixAffinePta(
        pixs: *mut PIX,
        ptad: *mut PTA,
        ptas: *mut PTA,
        incolor: l_int32,
    ) -> *mut PIX;
}
extern "C" {
    pub fn pixAffine(pixs: *mut PIX, vc: *mut l_float32, incolor: l_int32) -> *mut PIX;
}
extern "C" {
    pub fn pixAffinePtaColor(
        pixs: *mut PIX,
        ptad: *mut PTA,
        ptas: *mut PTA,
        colorval: l_uint32,
    ) -> *mut PIX;
}
extern "C" {
    pub fn pixAffineColor(pixs: *mut PIX, vc: *mut l_float32, colorval: l_uint32) -> *mut PIX;
}
extern "C" {
    pub fn pixAffinePtaGray(
        pixs: *mut PIX,
        ptad: *mut PTA,
        ptas: *mut PTA,
        grayval: l_uint8,
    ) -> *mut PIX;
}
extern "C" {
    pub fn pixAffineGray(pixs: *mut PIX, vc: *mut l_float32, grayval: l_uint8) -> *mut PIX;
}
extern "C" {
    pub fn pixAffinePtaWithAlpha(
        pixs: *mut PIX,
        ptad: *mut PTA,
        ptas: *mut PTA,
        pixg: *mut PIX,
        fract: l_float32,
        border: l_int32,
    ) -> *mut PIX;
}
extern "C" {
    pub fn getAffineXformCoeffs(
        ptas: *mut PTA,
        ptad: *mut PTA,
        pvc: *mut *mut l_float32,
    ) -> l_int32;
}
extern "C" {
    pub fn affineInvertXform(vc: *mut l_float32, pvci: *mut *mut l_float32) -> l_int32;
}
extern "C" {
    pub fn affineXformSampledPt(
        vc: *mut l_float32,
        x: l_int32,
        y: l_int32,
        pxp: *mut l_int32,
        pyp: *mut l_int32,
    ) -> l_int32;
}
extern "C" {
    pub fn affineXformPt(
        vc: *mut l_float32,
        x: l_int32,
        y: l_int32,
        pxp: *mut l_float32,
        pyp: *mut l_float32,
    ) -> l_int32;
}
extern "C" {
    pub fn linearInterpolatePixelColor(
        datas: *mut l_uint32,
        wpls: l_int32,
        w: l_int32,
        h: l_int32,
        x: l_float32,
        y: l_float32,
        colorval: l_uint32,
        pval: *mut l_uint32,
    ) -> l_int32;
}
extern "C" {
    pub fn linearInterpolatePixelGray(
        datas: *mut l_uint32,
        wpls: l_int32,
        w: l_int32,
        h: l_int32,
        x: l_float32,
        y: l_float32,
        grayval: l_int32,
        pval: *mut l_int32,
    ) -> l_int32;
}
extern "C" {
    pub fn gaussjordan(a: *mut *mut l_float32, b: *mut l_float32, n: l_int32) -> l_int32;
}
extern "C" {
    pub fn pixAffineSequential(
        pixs: *mut PIX,
        ptad: *mut PTA,
        ptas: *mut PTA,
        bw: l_int32,
        bh: l_int32,
    ) -> *mut PIX;
}
extern "C" {
    pub fn createMatrix2dTranslate(transx: l_float32, transy: l_float32) -> *mut l_float32;
}
extern "C" {
    pub fn createMatrix2dScale(scalex: l_float32, scaley: l_float32) -> *mut l_float32;
}
extern "C" {
    pub fn createMatrix2dRotate(xc: l_float32, yc: l_float32, angle: l_float32) -> *mut l_float32;
}
extern "C" {
    pub fn ptaTranslate(ptas: *mut PTA, transx: l_float32, transy: l_float32) -> *mut PTA;
}
extern "C" {
    pub fn ptaScale(ptas: *mut PTA, scalex: l_float32, scaley: l_float32) -> *mut PTA;
}
extern "C" {
    pub fn ptaRotate(ptas: *mut PTA, xc: l_float32, yc: l_float32, angle: l_float32) -> *mut PTA;
}
extern "C" {
    pub fn boxaTranslate(boxas: *mut BOXA, transx: l_float32, transy: l_float32) -> *mut BOXA;
}
extern "C" {
    pub fn boxaScale(boxas: *mut BOXA, scalex: l_float32, scaley: l_float32) -> *mut BOXA;
}
extern "C" {
    pub fn boxaRotate(
        boxas: *mut BOXA,
        xc: l_float32,
        yc: l_float32,
        angle: l_float32,
    ) -> *mut BOXA;
}
extern "C" {
    pub fn ptaAffineTransform(ptas: *mut PTA, mat: *mut l_float32) -> *mut PTA;
}
extern "C" {
    pub fn boxaAffineTransform(boxas: *mut BOXA, mat: *mut l_float32) -> *mut BOXA;
}
extern "C" {
    pub fn l_productMatVec(
        mat: *mut l_float32,
        vecs: *mut l_float32,
        vecd: *mut l_float32,
        size: l_int32,
    ) -> l_int32;
}
extern "C" {
    pub fn l_productMat2(
        mat1: *mut l_float32,
        mat2: *mut l_float32,
        matd: *mut l_float32,
        size: l_int32,
    ) -> l_int32;
}
extern "C" {
    pub fn l_productMat3(
        mat1: *mut l_float32,
        mat2: *mut l_float32,
        mat3: *mut l_float32,
        matd: *mut l_float32,
        size: l_int32,
    ) -> l_int32;
}
extern "C" {
    pub fn l_productMat4(
        mat1: *mut l_float32,
        mat2: *mut l_float32,
        mat3: *mut l_float32,
        mat4: *mut l_float32,
        matd: *mut l_float32,
        size: l_int32,
    ) -> l_int32;
}
extern "C" {
    pub fn l_getDataBit(line: *mut ::std::os::raw::c_void, n: l_int32) -> l_int32;
}
extern "C" {
    pub fn l_setDataBit(line: *mut ::std::os::raw::c_void, n: l_int32);
}
extern "C" {
    pub fn l_clearDataBit(line: *mut ::std::os::raw::c_void, n: l_int32);
}
extern "C" {
    pub fn l_setDataBitVal(line: *mut ::std::os::raw::c_void, n: l_int32, val: l_int32);
}
extern "C" {
    pub fn l_getDataDibit(line: *mut ::std::os::raw::c_void, n: l_int32) -> l_int32;
}
extern "C" {
    pub fn l_setDataDibit(line: *mut ::std::os::raw::c_void, n: l_int32, val: l_int32);
}
extern "C" {
    pub fn l_clearDataDibit(line: *mut ::std::os::raw::c_void, n: l_int32);
}
extern "C" {
    pub fn l_getDataQbit(line: *mut ::std::os::raw::c_void, n: l_int32) -> l_int32;
}
extern "C" {
    pub fn l_setDataQbit(line: *mut ::std::os::raw::c_void, n: l_int32, val: l_int32);
}
extern "C" {
    pub fn l_clearDataQbit(line: *mut ::std::os::raw::c_void, n: l_int32);
}
extern "C" {
    pub fn l_getDataByte(line: *mut ::std::os::raw::c_void, n: l_int32) -> l_int32;
}
extern "C" {
    pub fn l_setDataByte(line: *mut ::std::os::raw::c_void, n: l_int32, val: l_int32);
}
extern "C" {
    pub fn l_getDataTwoBytes(line: *mut ::std::os::raw::c_void, n: l_int32) -> l_int32;
}
extern "C" {
    pub fn l_setDataTwoBytes(line: *mut ::std::os::raw::c_void, n: l_int32, val: l_int32);
}
extern "C" {
    pub fn l_getDataFourBytes(line: *mut ::std::os::raw::c_void, n: l_int32) -> l_int32;
}
extern "C" {
    pub fn l_setDataFourBytes(line: *mut ::std::os::raw::c_void, n: l_int32, val: l_int32);
}
extern "C" {
    pub fn barcodeDispatchDecoder(
        barstr: *mut ::std::os::raw::c_char,
        format: l_int32,
        debugflag: l_int32,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn barcodeFormatIsSupported(format: l_int32) -> l_int32;
}
extern "C" {
    pub fn pixFindBaselines(pixs: *mut PIX, ppta: *mut *mut PTA, pixadb: *mut PIXA) -> *mut NUMA;
}
extern "C" {
    pub fn pixDeskewLocal(
        pixs: *mut PIX,
        nslices: l_int32,
        redsweep: l_int32,
        redsearch: l_int32,
        sweeprange: l_float32,
        sweepdelta: l_float32,
        minbsdelta: l_float32,
    ) -> *mut PIX;
}
extern "C" {
    pub fn pixGetLocalSkewTransform(
        pixs: *mut PIX,
        nslices: l_int32,
        redsweep: l_int32,
        redsearch: l_int32,
        sweeprange: l_float32,
        sweepdelta: l_float32,
        minbsdelta: l_float32,
        pptas: *mut *mut PTA,
        pptad: *mut *mut PTA,
    ) -> l_int32;
}
extern "C" {
    pub fn pixGetLocalSkewAngles(
        pixs: *mut PIX,
        nslices: l_int32,
        redsweep: l_int32,
        redsearch: l_int32,
        sweeprange: l_float32,
        sweepdelta: l_float32,
        minbsdelta: l_float32,
        pa: *mut l_float32,
        pb: *mut l_float32,
        debug: l_int32,
    ) -> *mut NUMA;
}
extern "C" {
    pub fn bbufferCreate(indata: *mut l_uint8, nalloc: l_int32) -> *mut L_BBUFFER;
}
extern "C" {
    pub fn bbufferDestroy(pbb: *mut *mut L_BBUFFER);
}
extern "C" {
    pub fn bbufferDestroyAndSaveData(pbb: *mut *mut L_BBUFFER, pnbytes: *mut usize)
        -> *mut l_uint8;
}
extern "C" {
    pub fn bbufferRead(bb: *mut L_BBUFFER, src: *mut l_uint8, nbytes: l_int32) -> l_int32;
}
extern "C" {
    pub fn bbufferReadStream(bb: *mut L_BBUFFER, fp: *mut FILE, nbytes: l_int32) -> l_int32;
}
extern "C" {
    pub fn bbufferExtendArray(bb: *mut L_BBUFFER, nbytes: l_int32) -> l_int32;
}
extern "C" {
    pub fn bbufferWrite(
        bb: *mut L_BBUFFER,
        dest: *mut l_uint8,
        nbytes: usize,
        pnout: *mut usize,
    ) -> l_int32;
}
extern "C" {
    pub fn bbufferWriteStream(
        bb: *mut L_BBUFFER,
        fp: *mut FILE,
        nbytes: usize,
        pnout: *mut usize,
    ) -> l_int32;
}
extern "C" {
    pub fn pixBilateral(
        pixs: *mut PIX,
        spatial_stdev: l_float32,
        range_stdev: l_float32,
        ncomps: l_int32,
        reduction: l_int32,
    ) -> *mut PIX;
}
extern "C" {
    pub fn pixBilateralGray(
        pixs: *mut PIX,
        spatial_stdev: l_float32,
        range_stdev: l_float32,
        ncomps: l_int32,
        reduction: l_int32,
    ) -> *mut PIX;
}
extern "C" {
    pub fn pixBilateralExact(
        pixs: *mut PIX,
        spatial_kel: *mut L_KERNEL,
        range_kel: *mut L_KERNEL,
    ) -> *mut PIX;
}
extern "C" {
    pub fn pixBilateralGrayExact(
        pixs: *mut PIX,
        spatial_kel: *mut L_KERNEL,
        range_kel: *mut L_KERNEL,
    ) -> *mut PIX;
}
extern "C" {
    pub fn pixBlockBilateralExact(
        pixs: *mut PIX,
        spatial_stdev: l_float32,
        range_stdev: l_float32,
    ) -> *mut PIX;
}
extern "C" {
    pub fn makeRangeKernel(range_stdev: l_float32) -> *mut L_KERNEL;
}
extern "C" {
    pub fn pixBilinearSampledPta(
        pixs: *mut PIX,
        ptad: *mut PTA,
        ptas: *mut PTA,
        incolor: l_int32,
    ) -> *mut PIX;
}
extern "C" {
    pub fn pixBilinearSampled(pixs: *mut PIX, vc: *mut l_float32, incolor: l_int32) -> *mut PIX;
}
extern "C" {
    pub fn pixBilinearPta(
        pixs: *mut PIX,
        ptad: *mut PTA,
        ptas: *mut PTA,
        incolor: l_int32,
    ) -> *mut PIX;
}
extern "C" {
    pub fn pixBilinear(pixs: *mut PIX, vc: *mut l_float32, incolor: l_int32) -> *mut PIX;
}
extern "C" {
    pub fn pixBilinearPtaColor(
        pixs: *mut PIX,
        ptad: *mut PTA,
        ptas: *mut PTA,
        colorval: l_uint32,
    ) -> *mut PIX;
}
extern "C" {
    pub fn pixBilinearColor(pixs: *mut PIX, vc: *mut l_float32, colorval: l_uint32) -> *mut PIX;
}
extern "C" {
    pub fn pixBilinearPtaGray(
        pixs: *mut PIX,
        ptad: *mut PTA,
        ptas: *mut PTA,
        grayval: l_uint8,
    ) -> *mut PIX;
}
extern "C" {
    pub fn pixBilinearGray(pixs: *mut PIX, vc: *mut l_float32, grayval: l_uint8) -> *mut PIX;
}
extern "C" {
    pub fn pixBilinearPtaWithAlpha(
        pixs: *mut PIX,
        ptad: *mut PTA,
        ptas: *mut PTA,
        pixg: *mut PIX,
        fract: l_float32,
        border: l_int32,
    ) -> *mut PIX;
}
extern "C" {
    pub fn getBilinearXformCoeffs(
        ptas: *mut PTA,
        ptad: *mut PTA,
        pvc: *mut *mut l_float32,
    ) -> l_int32;
}
extern "C" {
    pub fn bilinearXformSampledPt(
        vc: *mut l_float32,
        x: l_int32,
        y: l_int32,
        pxp: *mut l_int32,
        pyp: *mut l_int32,
    ) -> l_int32;
}
extern "C" {
    pub fn bilinearXformPt(
        vc: *mut l_float32,
        x: l_int32,
        y: l_int32,
        pxp: *mut l_float32,
        pyp: *mut l_float32,
    ) -> l_int32;
}
extern "C" {
    pub fn pixOtsuAdaptiveThreshold(
        pixs: *mut PIX,
        sx: l_int32,
        sy: l_int32,
        smoothx: l_int32,
        smoothy: l_int32,
        scorefract: l_float32,
        ppixth: *mut *mut PIX,
        ppixd: *mut *mut PIX,
    ) -> l_int32;
}
extern "C" {
    pub fn pixOtsuThreshOnBackgroundNorm(
        pixs: *mut PIX,
        pixim: *mut PIX,
        sx: l_int32,
        sy: l_int32,
        thresh: l_int32,
        mincount: l_int32,
        bgval: l_int32,
        smoothx: l_int32,
        smoothy: l_int32,
        scorefract: l_float32,
        pthresh: *mut l_int32,
    ) -> *mut PIX;
}
extern "C" {
    pub fn pixMaskedThreshOnBackgroundNorm(
        pixs: *mut PIX,
        pixim: *mut PIX,
        sx: l_int32,
        sy: l_int32,
        thresh: l_int32,
        mincount: l_int32,
        smoothx: l_int32,
        smoothy: l_int32,
        scorefract: l_float32,
        pthresh: *mut l_int32,
    ) -> *mut PIX;
}
extern "C" {
    pub fn pixSauvolaBinarizeTiled(
        pixs: *mut PIX,
        whsize: l_int32,
        factor: l_float32,
        nx: l_int32,
        ny: l_int32,
        ppixth: *mut *mut PIX,
        ppixd: *mut *mut PIX,
    ) -> l_int32;
}
extern "C" {
    pub fn pixSauvolaBinarize(
        pixs: *mut PIX,
        whsize: l_int32,
        factor: l_float32,
        addborder: l_int32,
        ppixm: *mut *mut PIX,
        ppixsd: *mut *mut PIX,
        ppixth: *mut *mut PIX,
        ppixd: *mut *mut PIX,
    ) -> l_int32;
}
extern "C" {
    pub fn pixSauvolaGetThreshold(
        pixm: *mut PIX,
        pixms: *mut PIX,
        factor: l_float32,
        ppixsd: *mut *mut PIX,
    ) -> *mut PIX;
}
extern "C" {
    pub fn pixApplyLocalThreshold(pixs: *mut PIX, pixth: *mut PIX, redfactor: l_int32) -> *mut PIX;
}
extern "C" {
    pub fn pixThresholdByConnComp(
        pixs: *mut PIX,
        pixm: *mut PIX,
        start: l_int32,
        end: l_int32,
        incr: l_int32,
        thresh48: l_float32,
        threshdiff: l_float32,
        pglobthresh: *mut l_int32,
        ppixd: *mut *mut PIX,
        debugflag: l_int32,
    ) -> l_int32;
}
extern "C" {
    pub fn pixExpandBinaryReplicate(pixs: *mut PIX, xfact: l_int32, yfact: l_int32) -> *mut PIX;
}
extern "C" {
    pub fn pixExpandBinaryPower2(pixs: *mut PIX, factor: l_int32) -> *mut PIX;
}
extern "C" {
    pub fn pixReduceBinary2(pixs: *mut PIX, intab: *mut l_uint8) -> *mut PIX;
}
extern "C" {
    pub fn pixReduceRankBinaryCascade(
        pixs: *mut PIX,
        level1: l_int32,
        level2: l_int32,
        level3: l_int32,
        level4: l_int32,
    ) -> *mut PIX;
}
extern "C" {
    pub fn pixReduceRankBinary2(pixs: *mut PIX, level: l_int32, intab: *mut l_uint8) -> *mut PIX;
}
extern "C" {
    pub fn makeSubsampleTab2x() -> *mut l_uint8;
}
extern "C" {
    pub fn pixBlend(
        pixs1: *mut PIX,
        pixs2: *mut PIX,
        x: l_int32,
        y: l_int32,
        fract: l_float32,
    ) -> *mut PIX;
}
extern "C" {
    pub fn pixBlendMask(
        pixd: *mut PIX,
        pixs1: *mut PIX,
        pixs2: *mut PIX,
        x: l_int32,
        y: l_int32,
        fract: l_float32,
        type_: l_int32,
    ) -> *mut PIX;
}
extern "C" {
    pub fn pixBlendGray(
        pixd: *mut PIX,
        pixs1: *mut PIX,
        pixs2: *mut PIX,
        x: l_int32,
        y: l_int32,
        fract: l_float32,
        type_: l_int32,
        transparent: l_int32,
        transpix: l_uint32,
    ) -> *mut PIX;
}
extern "C" {
    pub fn pixBlendGrayInverse(
        pixd: *mut PIX,
        pixs1: *mut PIX,
        pixs2: *mut PIX,
        x: l_int32,
        y: l_int32,
        fract: l_float32,
    ) -> *mut PIX;
}
extern "C" {
    pub fn pixBlendColor(
        pixd: *mut PIX,
        pixs1: *mut PIX,
        pixs2: *mut PIX,
        x: l_int32,
        y: l_int32,
        fract: l_float32,
        transparent: l_int32,
        transpix: l_uint32,
    ) -> *mut PIX;
}
extern "C" {
    pub fn pixBlendColorByChannel(
        pixd: *mut PIX,
        pixs1: *mut PIX,
        pixs2: *mut PIX,
        x: l_int32,
        y: l_int32,
        rfract: l_float32,
        gfract: l_float32,
        bfract: l_float32,
        transparent: l_int32,
        transpix: l_uint32,
    ) -> *mut PIX;
}
extern "C" {
    pub fn pixBlendGrayAdapt(
        pixd: *mut PIX,
        pixs1: *mut PIX,
        pixs2: *mut PIX,
        x: l_int32,
        y: l_int32,
        fract: l_float32,
        shift: l_int32,
    ) -> *mut PIX;
}
extern "C" {
    pub fn pixFadeWithGray(
        pixs: *mut PIX,
        pixb: *mut PIX,
        factor: l_float32,
        type_: l_int32,
    ) -> *mut PIX;
}
extern "C" {
    pub fn pixBlendHardLight(
        pixd: *mut PIX,
        pixs1: *mut PIX,
        pixs2: *mut PIX,
        x: l_int32,
        y: l_int32,
        fract: l_float32,
    ) -> *mut PIX;
}
extern "C" {
    pub fn pixBlendCmap(
        pixs: *mut PIX,
        pixb: *mut PIX,
        x: l_int32,
        y: l_int32,
        sindex: l_int32,
    ) -> l_int32;
}
extern "C" {
    pub fn pixBlendWithGrayMask(
        pixs1: *mut PIX,
        pixs2: *mut PIX,
        pixg: *mut PIX,
        x: l_int32,
        y: l_int32,
    ) -> *mut PIX;
}
extern "C" {
    pub fn pixBlendBackgroundToColor(
        pixd: *mut PIX,
        pixs: *mut PIX,
        box_: *mut BOX,
        color: l_uint32,
        gamma: l_float32,
        minval: l_int32,
        maxval: l_int32,
    ) -> *mut PIX;
}
extern "C" {
    pub fn pixMultiplyByColor(
        pixd: *mut PIX,
        pixs: *mut PIX,
        box_: *mut BOX,
        color: l_uint32,
    ) -> *mut PIX;
}
extern "C" {
    pub fn pixAlphaBlendUniform(pixs: *mut PIX, color: l_uint32) -> *mut PIX;
}
extern "C" {
    pub fn pixAddAlphaToBlend(pixs: *mut PIX, fract: l_float32, invert: l_int32) -> *mut PIX;
}
extern "C" {
    pub fn pixSetAlphaOverWhite(pixs: *mut PIX) -> *mut PIX;
}
extern "C" {
    pub fn pixLinearEdgeFade(
        pixs: *mut PIX,
        dir: l_int32,
        fadeto: l_int32,
        distfract: l_float32,
        maxfade: l_float32,
    ) -> l_int32;
}
extern "C" {
    pub fn bmfCreate(dir: *const ::std::os::raw::c_char, fontsize: l_int32) -> *mut L_BMF;
}
extern "C" {
    pub fn bmfDestroy(pbmf: *mut *mut L_BMF);
}
extern "C" {
    pub fn bmfGetPix(bmf: *mut L_BMF, chr: ::std::os::raw::c_char) -> *mut PIX;
}
extern "C" {
    pub fn bmfGetWidth(bmf: *mut L_BMF, chr: ::std::os::raw::c_char, pw: *mut l_int32) -> l_int32;
}
extern "C" {
    pub fn bmfGetBaseline(
        bmf: *mut L_BMF,
        chr: ::std::os::raw::c_char,
        pbaseline: *mut l_int32,
    ) -> l_int32;
}
extern "C" {
    pub fn pixaGetFont(
        dir: *const ::std::os::raw::c_char,
        fontsize: l_int32,
        pbl0: *mut l_int32,
        pbl1: *mut l_int32,
        pbl2: *mut l_int32,
    ) -> *mut PIXA;
}
extern "C" {
    pub fn pixaSaveFont(
        indir: *const ::std::os::raw::c_char,
        outdir: *const ::std::os::raw::c_char,
        fontsize: l_int32,
    ) -> l_int32;
}
extern "C" {
    pub fn pixReadStreamBmp(fp: *mut FILE) -> *mut PIX;
}
extern "C" {
    pub fn pixReadMemBmp(cdata: *const l_uint8, size: usize) -> *mut PIX;
}
extern "C" {
    pub fn pixWriteStreamBmp(fp: *mut FILE, pix: *mut PIX) -> l_int32;
}
extern "C" {
    pub fn pixWriteMemBmp(pfdata: *mut *mut l_uint8, pfsize: *mut usize, pixs: *mut PIX)
        -> l_int32;
}
extern "C" {
    pub fn l_bootnum_gen1() -> *mut PIXA;
}
extern "C" {
    pub fn l_bootnum_gen2() -> *mut PIXA;
}
extern "C" {
    pub fn l_bootnum_gen3() -> *mut PIXA;
}
extern "C" {
    pub fn boxCreate(x: l_int32, y: l_int32, w: l_int32, h: l_int32) -> *mut BOX;
}
extern "C" {
    pub fn boxCreateValid(x: l_int32, y: l_int32, w: l_int32, h: l_int32) -> *mut BOX;
}
extern "C" {
    pub fn boxCopy(box_: *mut BOX) -> *mut BOX;
}
extern "C" {
    pub fn boxClone(box_: *mut BOX) -> *mut BOX;
}
extern "C" {
    pub fn boxDestroy(pbox: *mut *mut BOX);
}
extern "C" {
    pub fn boxGetGeometry(
        box_: *mut BOX,
        px: *mut l_int32,
        py: *mut l_int32,
        pw: *mut l_int32,
        ph: *mut l_int32,
    ) -> l_int32;
}
extern "C" {
    pub fn boxSetGeometry(
        box_: *mut BOX,
        x: l_int32,
        y: l_int32,
        w: l_int32,
        h: l_int32,
    ) -> l_int32;
}
extern "C" {
    pub fn boxGetSideLocations(
        box_: *mut BOX,
        pl: *mut l_int32,
        pr: *mut l_int32,
        pt: *mut l_int32,
        pb: *mut l_int32,
    ) -> l_int32;
}
extern "C" {
    pub fn boxSetSideLocations(
        box_: *mut BOX,
        l: l_int32,
        r: l_int32,
        t: l_int32,
        b: l_int32,
    ) -> l_int32;
}
extern "C" {
    pub fn boxGetRefcount(box_: *mut BOX) -> l_int32;
}
extern "C" {
    pub fn boxChangeRefcount(box_: *mut BOX, delta: l_int32) -> l_int32;
}
extern "C" {
    pub fn boxIsValid(box_: *mut BOX, pvalid: *mut l_int32) -> l_int32;
}
extern "C" {
    pub fn boxaCreate(n: l_int32) -> *mut BOXA;
}
extern "C" {
    pub fn boxaCopy(boxa: *mut BOXA, copyflag: l_int32) -> *mut BOXA;
}
extern "C" {
    pub fn boxaDestroy(pboxa: *mut *mut BOXA);
}
extern "C" {
    pub fn boxaAddBox(boxa: *mut BOXA, box_: *mut BOX, copyflag: l_int32) -> l_int32;
}
extern "C" {
    pub fn boxaExtendArray(boxa: *mut BOXA) -> l_int32;
}
extern "C" {
    pub fn boxaExtendArrayToSize(boxa: *mut BOXA, size: l_int32) -> l_int32;
}
extern "C" {
    pub fn boxaGetCount(boxa: *mut BOXA) -> l_int32;
}
extern "C" {
    pub fn boxaGetValidCount(boxa: *mut BOXA) -> l_int32;
}
extern "C" {
    pub fn boxaGetBox(boxa: *mut BOXA, index: l_int32, accessflag: l_int32) -> *mut BOX;
}
extern "C" {
    pub fn boxaGetValidBox(boxa: *mut BOXA, index: l_int32, accessflag: l_int32) -> *mut BOX;
}
extern "C" {
    pub fn boxaFindInvalidBoxes(boxa: *mut BOXA) -> *mut NUMA;
}
extern "C" {
    pub fn boxaGetBoxGeometry(
        boxa: *mut BOXA,
        index: l_int32,
        px: *mut l_int32,
        py: *mut l_int32,
        pw: *mut l_int32,
        ph: *mut l_int32,
    ) -> l_int32;
}
extern "C" {
    pub fn boxaIsFull(boxa: *mut BOXA, pfull: *mut l_int32) -> l_int32;
}
extern "C" {
    pub fn boxaReplaceBox(boxa: *mut BOXA, index: l_int32, box_: *mut BOX) -> l_int32;
}
extern "C" {
    pub fn boxaInsertBox(boxa: *mut BOXA, index: l_int32, box_: *mut BOX) -> l_int32;
}
extern "C" {
    pub fn boxaRemoveBox(boxa: *mut BOXA, index: l_int32) -> l_int32;
}
extern "C" {
    pub fn boxaRemoveBoxAndSave(boxa: *mut BOXA, index: l_int32, pbox: *mut *mut BOX) -> l_int32;
}
extern "C" {
    pub fn boxaSaveValid(boxas: *mut BOXA, copyflag: l_int32) -> *mut BOXA;
}
extern "C" {
    pub fn boxaInitFull(boxa: *mut BOXA, box_: *mut BOX) -> l_int32;
}
extern "C" {
    pub fn boxaClear(boxa: *mut BOXA) -> l_int32;
}
extern "C" {
    pub fn boxaaCreate(n: l_int32) -> *mut BOXAA;
}
extern "C" {
    pub fn boxaaCopy(baas: *mut BOXAA, copyflag: l_int32) -> *mut BOXAA;
}
extern "C" {
    pub fn boxaaDestroy(pbaa: *mut *mut BOXAA);
}
extern "C" {
    pub fn boxaaAddBoxa(baa: *mut BOXAA, ba: *mut BOXA, copyflag: l_int32) -> l_int32;
}
extern "C" {
    pub fn boxaaExtendArray(baa: *mut BOXAA) -> l_int32;
}
extern "C" {
    pub fn boxaaExtendArrayToSize(baa: *mut BOXAA, size: l_int32) -> l_int32;
}
extern "C" {
    pub fn boxaaGetCount(baa: *mut BOXAA) -> l_int32;
}
extern "C" {
    pub fn boxaaGetBoxCount(baa: *mut BOXAA) -> l_int32;
}
extern "C" {
    pub fn boxaaGetBoxa(baa: *mut BOXAA, index: l_int32, accessflag: l_int32) -> *mut BOXA;
}
extern "C" {
    pub fn boxaaGetBox(
        baa: *mut BOXAA,
        iboxa: l_int32,
        ibox: l_int32,
        accessflag: l_int32,
    ) -> *mut BOX;
}
extern "C" {
    pub fn boxaaInitFull(baa: *mut BOXAA, boxa: *mut BOXA) -> l_int32;
}
extern "C" {
    pub fn boxaaExtendWithInit(baa: *mut BOXAA, maxindex: l_int32, boxa: *mut BOXA) -> l_int32;
}
extern "C" {
    pub fn boxaaReplaceBoxa(baa: *mut BOXAA, index: l_int32, boxa: *mut BOXA) -> l_int32;
}
extern "C" {
    pub fn boxaaInsertBoxa(baa: *mut BOXAA, index: l_int32, boxa: *mut BOXA) -> l_int32;
}
extern "C" {
    pub fn boxaaRemoveBoxa(baa: *mut BOXAA, index: l_int32) -> l_int32;
}
extern "C" {
    pub fn boxaaAddBox(
        baa: *mut BOXAA,
        index: l_int32,
        box_: *mut BOX,
        accessflag: l_int32,
    ) -> l_int32;
}
extern "C" {
    pub fn boxaaReadFromFiles(
        dirname: *const ::std::os::raw::c_char,
        substr: *const ::std::os::raw::c_char,
        first: l_int32,
        nfiles: l_int32,
    ) -> *mut BOXAA;
}
extern "C" {
    pub fn boxaaRead(filename: *const ::std::os::raw::c_char) -> *mut BOXAA;
}
extern "C" {
    pub fn boxaaReadStream(fp: *mut FILE) -> *mut BOXAA;
}
extern "C" {
    pub fn boxaaReadMem(data: *const l_uint8, size: usize) -> *mut BOXAA;
}
extern "C" {
    pub fn boxaaWrite(filename: *const ::std::os::raw::c_char, baa: *mut BOXAA) -> l_int32;
}
extern "C" {
    pub fn boxaaWriteStream(fp: *mut FILE, baa: *mut BOXAA) -> l_int32;
}
extern "C" {
    pub fn boxaaWriteMem(pdata: *mut *mut l_uint8, psize: *mut usize, baa: *mut BOXAA) -> l_int32;
}
extern "C" {
    pub fn boxaRead(filename: *const ::std::os::raw::c_char) -> *mut BOXA;
}
extern "C" {
    pub fn boxaReadStream(fp: *mut FILE) -> *mut BOXA;
}
extern "C" {
    pub fn boxaReadMem(data: *const l_uint8, size: usize) -> *mut BOXA;
}
extern "C" {
    pub fn boxaWrite(filename: *const ::std::os::raw::c_char, boxa: *mut BOXA) -> l_int32;
}
extern "C" {
    pub fn boxaWriteStream(fp: *mut FILE, boxa: *mut BOXA) -> l_int32;
}
extern "C" {
    pub fn boxaWriteMem(pdata: *mut *mut l_uint8, psize: *mut usize, boxa: *mut BOXA) -> l_int32;
}
extern "C" {
    pub fn boxPrintStreamInfo(fp: *mut FILE, box_: *mut BOX) -> l_int32;
}
extern "C" {
    pub fn boxContains(box1: *mut BOX, box2: *mut BOX, presult: *mut l_int32) -> l_int32;
}
extern "C" {
    pub fn boxIntersects(box1: *mut BOX, box2: *mut BOX, presult: *mut l_int32) -> l_int32;
}
extern "C" {
    pub fn boxaContainedInBox(boxas: *mut BOXA, box_: *mut BOX) -> *mut BOXA;
}
extern "C" {
    pub fn boxaContainedInBoxCount(
        boxa: *mut BOXA,
        box_: *mut BOX,
        pcount: *mut l_int32,
    ) -> l_int32;
}
extern "C" {
    pub fn boxaContainedInBoxa(
        boxa1: *mut BOXA,
        boxa2: *mut BOXA,
        pcontained: *mut l_int32,
    ) -> l_int32;
}
extern "C" {
    pub fn boxaIntersectsBox(boxas: *mut BOXA, box_: *mut BOX) -> *mut BOXA;
}
extern "C" {
    pub fn boxaIntersectsBoxCount(boxa: *mut BOXA, box_: *mut BOX, pcount: *mut l_int32)
        -> l_int32;
}
extern "C" {
    pub fn boxaClipToBox(boxas: *mut BOXA, box_: *mut BOX) -> *mut BOXA;
}
extern "C" {
    pub fn boxaCombineOverlaps(boxas: *mut BOXA, pixadb: *mut PIXA) -> *mut BOXA;
}
extern "C" {
    pub fn boxaCombineOverlapsInPair(
        boxas1: *mut BOXA,
        boxas2: *mut BOXA,
        pboxad1: *mut *mut BOXA,
        pboxad2: *mut *mut BOXA,
        pixadb: *mut PIXA,
    ) -> l_int32;
}
extern "C" {
